[
    {
        "page_content": "## Abstract\n\nWe present a class of efficient models called MobileNets for mobile and embedded vision applications. MobileNets are based on a streamlined architecture that uses depthwise separable convolutions to build light weight deep neural networks. We introduce two simple global hyperparameters that efficiently trade off between latency and accuracy. These hyper-parameters allow the model builder to choose the right sized model for their application based on the constraints of the problem. We present extensive experiments on resource and accuracy tradeoffs and show strong performance compared to other popular models on ImageNet classification. We then demonstrate the effectiveness of MobileNets across a wide range of applications and use cases including object detection, finegrain classification, face attributes and large scale geo-localization.",
        "metadata": {
            "section_header": "Abstract",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1. Introduction\n\nConvolutional neural networks have become ubiquitous in computer vision ever since AlexNet [19] popularized deep convolutional neural networks by winning the ImageNet Challenge: ILSVRC 2012 [24]. The general trend has been to make deeper and more complicated networks in order to achieve higher accuracy [27, 31, 29, 8]. However, these advances to improve accuracy are not necessarily making networks more efficient with respect to size and speed. In many real world applications such as robotics, self-driving car and augmented reality, the recognition tasks need to be carried out in a timely fashion on a computationally limited platform.\n\nThis paper describes an efficient network architecture and a set of two hyper-parameters in order to build very small, low latency models that can be easily matched to the design requirements for mobile and embedded vision applications. Section 2 reviews prior work in building small models. Section 3 describes the MobileNet architecture and two hyper-parameters width multiplier and resolution multiplier to define smaller and more efficient MobileNets. Section 4 describes experiments on ImageNet as well a variety of different applications and use cases. Section 5 closes with a summary and conclusion.",
        "metadata": {
            "section_header": "Introduction",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 2. Prior Work\n\nThere has been rising interest in building small and efficient neural networks in the recent literature, e.g. [16, 34, 12, 36, 22]. Many different approaches can be generally categorized into either compressing pretrained networks or training small networks directly. This paper proposes a class of network architectures that allows a model developer to specifically choose a small network that matches the resource restrictions (latency, size) for their application. MobileNets primarily focus on optimizing for latency but also yield small networks. Many papers on small networks focus only on size but do not consider speed.\n\nMobileNets are built primarily from depthwise separable convolutions initially introduced in [26] and subsequently used in Inception models [13] to reduce the computation in the first few layers. Flattened networks [16] build a network out of fully factorized convolutions and showed the potential of extremely factorized networks. Independent of this current paper, Factorized Networks[34] introduces a similar factorized convolution as well as the use of topological connections. Subsequently, the Xception network [3] demonstrated how to scale up depthwise separable filters to out perform Inception V3 networks. Another small network is Squeezenet [12] which uses a bottleneck approach to design a very small network. Other reduced computation networks include structured transform networks [28] and deep fried convnets [37].\n\nA different approach for obtaining small networks is shrinking, factorizing or compressing pretrained networks. Compression based on product quantization [36], hashing\n\nProprietary + Confidential\n\nFigure 1. MobileNet models can be applied to various recognition tasks for efficient on device intelligence.\n\n<!-- image -->\n\n[2], and pruning, vector quantization and Huffman coding [5] have been proposed in the literature. Additionally various factorizations have been proposed to speed up pretrained networks [14, 20]. Another method for training small networks is distillation [9] which uses a larger network to teach a smaller network. It is complementary to our approach and is covered in some of our use cases in section 4. Another emerging approach is low bit networks [4, 22, 11].\n\nD F × M feature map F and produces a D F × D F × N feature map G where D F is the spatial width and height of a square input feature map , 1 M is the number of input channels (input depth), D G is the spatial width and height of a square output feature map and N is the number of output channel (output depth).",
        "metadata": {
            "section_header": "Prior Work",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3. MobileNet Architecture\n\nIn this section we first describe the core layers that MobileNet is built on which are depthwise separable filters. We then describe the MobileNet network structure and conclude with descriptions of the two model shrinking hyperparameters width multiplier and resolution multiplier.",
        "metadata": {
            "section_header": "MobileNet Architecture",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.1. Depthwise Separable Convolution\n\nThe MobileNet model is based on depthwise separable convolutions which is a form of factorized convolutions which factorize a standard convolution into a depthwise convolution and a 1 × 1 convolution called a pointwise convolution. For MobileNets the depthwise convolution applies a single filter to each input channel. The pointwise convolution then applies a 1 × 1 convolution to combine the outputs the depthwise convolution. A standard convolution both filters and combines inputs into a new set of outputs in one step. The depthwise separable convolution splits this into two layers, a separate layer for filtering and a separate layer for combining. This factorization has the effect of drastically reducing computation and model size. Figure 2 shows how a standard convolution 2(a) is factorized into a depthwise convolution 2(b) and a 1 × 1 pointwise convolution 2(c).\n\nA standard convolutional layer takes as input a D F ×\n\nThe standard convolutional layer is parameterized by convolution kernel K of size D K × D K × M N × where D K is the spatial dimension of the kernel assumed to be square and M is number of input channels and N is the number of output channels as defined previously.\n\nThe output feature map for standard convolution assuming stride one and padding is computed as:\n\n<!-- formula-not-decoded -->\n\nStandard convolutions have the computational cost of:\n\n<!-- formula-not-decoded -->\n\nwhere the computational cost depends multiplicatively on the number of input channels M , the number of output channels N the kernel size D k × D k and the feature map size D F × D F . MobileNet models address each of these terms and their interactions. First it uses depthwise separable convolutions to break the interaction between the number of output channels and the size of the kernel.\n\nThe standard convolution operation has the effect of filtering features based on the convolutional kernels and combining features in order to produce a new representation. The filtering and combination steps can be split into two steps via the use of factorized convolutions called depthwise\n\n1 We assume that the output feature map has the same spatial dimensions as the input and both feature maps are square. Our model shrinking results generalize to feature maps with arbitrary sizes and aspect ratios.\n\nseparable convolutions for substantial reduction in computational cost.\n\nDepthwise separable convolution are made up of two layers: depthwise convolutions and pointwise convolutions. We use depthwise convolutions to apply a single filter per each input channel (input depth). Pointwise convolution, a simple 1 × 1 convolution, is then used to create a linear combination of the output of the depthwise layer. MobileNets use both batchnorm and ReLU nonlinearities for both layers.\n\nDepthwise convolution with one filter per input channel (input depth) can be written as:\n\n<!-- formula-not-decoded -->\n\nwhere ˆ K is the depthwise convolutional kernel of size D K × D K × M where the m th filter in ˆ K is applied to the m th channel in F to produce the m th channel of the filtered output feature map ˆ G .\n\nDepthwise convolution has a computational cost of:\n\n<!-- formula-not-decoded -->\n\nDepthwise convolution is extremely efficient relative to standard convolution. However it only filters input channels, it does not combine them to create new features. So an additional layer that computes a linear combination of the output of depthwise convolution via 1 × 1 convolution is needed in order to generate these new features.\n\nThe combination of depthwise convolution and 1 × 1 (pointwise) convolution is called depthwise separable convolution which was originally introduced in [26].\n\nDepthwise separable convolutions cost:\n\n<!-- formula-not-decoded -->\n\nwhich is the sum of the depthwise and 1 × 1 pointwise convolutions.\n\nBy expressing convolution as a two step process of filtering and combining we get a reduction in computation of:\n\n<!-- formula-not-decoded -->\n\nMobileNet uses 3 × 3 depthwise separable convolutions which uses between 8 to 9 times less computation than standard convolutions at only a small reduction in accuracy as seen in Section 4.\n\nAdditional factorization in spatial dimension such as in [16, 31] does not save much additional computation as very little computation is spent in depthwise convolutions.\n\n<!-- image -->\n\nD\n\nD\n\nK\n\nN\n\nK\n\nD\n\n(a) Standard Convolution Filters N\n\nK\n\n1\n\n<!-- image -->\n\nD\n\nM\n\nK\n\n(b) Depthwise Convolutional Filters\n\nM\n\n<!-- image -->\n\n...\n\nM\n\n(c) 1 × 1 Convolutional Filters called Pointwise Convolution in the context of Depthwise Separable Convolution\n\nFigure 2. The standard convolutional filters in (a) are replaced by two layers: depthwise convolution in (b) and pointwise convolution in (c) to build a depthwise separable filter.",
        "metadata": {
            "section_header": "Depthwise Separable Convolution",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.2. Network Structure and Training\n\nThe MobileNet structure is built on depthwise separable convolutions as mentioned in the previous section except for the first layer which is a full convolution. By defining the network in such simple terms we are able to easily explore network topologies to find a good network. The MobileNet architecture is defined in Table 1. All layers are followed by a batchnorm [13] and ReLU nonlinearity with the exception of the final fully connected layer which has no nonlinearity and feeds into a softmax layer for classification. Figure 3 contrasts a layer with regular convolutions, batchnorm and ReLU nonlinearity to the factorized layer with depthwise convolution, 1 × 1 pointwise convolution as well as batchnorm and ReLU after each convolutional layer. Down sampling is handled with strided convolution in the depthwise convolutions as well as in the first layer. A final average pooling reduces the spatial resolution to 1 before the fully connected layer. Counting depthwise and pointwise convolutions as separate layers, MobileNet has 28 layers.\n\nIt is not enough to simply define networks in terms of a small number of Mult-Adds. It is also important to make sure these operations can be efficiently implementable. For\n\n| 3x3 Conv   |\n|------------|\n| BN         |\n| ReLU       |\n\nFigure 3. Left: Standard convolutional layer with batchnorm and ReLU. Right: Depthwise Separable convolutions with Depthwise and Pointwise layers followed by batchnorm and ReLU.\n\n<!-- image -->\n\ninstance unstructured sparse matrix operations are not typically faster than dense matrix operations until a very high level of sparsity. Our model structure puts nearly all of the computation into dense 1 × 1 convolutions. This can be implemented with highly optimized general matrix multiply (GEMM) functions. Often convolutions are implemented by a GEMM but require an initial reordering in memory called im2col in order to map it to a GEMM. For instance, this approach is used in the popular Caffe package [15]. 1 × 1 convolutions do not require this reordering in memory and can be implemented directly with GEMM which is one of the most optimized numerical linear algebra algorithms. MobileNet spends 95% of it's computation time in 1 × 1 convolutions which also has 75% of the parameters as can be seen in Table 2. Nearly all of the additional parameters are in the fully connected layer.\n\nMobileNet models were trained in TensorFlow [1] using RMSprop [33] with asynchronous gradient descent similar to Inception V3 [31]. However, contrary to training large models we use less regularization and data augmentation techniques because small models have less trouble with overfitting. When training MobileNets we do not use side heads or label smoothing and additionally reduce the amount image of distortions by limiting the size of small crops that are used in large Inception training [31]. Additionally, we found that it was important to put very little or no weight decay (l2 regularization) on the depthwise filters since their are so few parameters in them. For the ImageNet benchmarks in the next section all models were trained with same training parameters regardless of the size of the model.",
        "metadata": {
            "section_header": "Network Structure and Training",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.3. Width Multiplier: Thinner Models\n\nAlthough the base MobileNet architecture is already small and low latency, many times a specific use case or application may require the model to be smaller and faster. In order to construct these smaller and less computationally expensive models we introduce a very simple parameter α called width multiplier. The role of the width multiplier α is to thin a network uniformly at each layer. For a given layer\n\nTable 1. MobileNet Body Architecture\n\n| Type / Stride              | Filter Shape                     | Input Size                  |\n|----------------------------|----------------------------------|-----------------------------|\n| Conv / s2                  | 3 × 3 × 3 × 32                   | 224 × 224 × 3               |\n| Conv dw / s1               | 3 × 3 × 32 dw                    | 112 × 112 × 32              |\n| Conv / s1                  | 1 × 1 × 32 × 64                  | 112 × 112 × 32              |\n| Conv dw / s2               | 3 × 3 × 64 dw                    | 112 × 112 × 64              |\n| Conv / s1                  | 1 × 1 × 64 × 128                 | 56 × 56 × 64                |\n| Conv dw / s1               | 3 × 3 × 128 dw                   | 56 × 56 × 128               |\n| Conv / s1                  | 1 × 1 × 128 × 128                | 56 × 56 × 128               |\n| Conv dw / s2               | 3 × 3 × 128 dw                   | 56 × 56 × 128               |\n| Conv / s1                  | 1 × 1 × 128 × 256                | 28 × 28 × 128               |\n| Conv dw / s1               | 3 × 3 × 256 dw                   | 28 × 28 × 256               |\n| Conv / s1                  | 1 × 1 × 256 × 256                | 28 × 28 × 256               |\n| Conv dw / s2               | 3 × 3 × 256 dw                   | 28 × 28 × 256               |\n| Conv / s1                  | 1 × 1 × 256 × 512                | 14 × 14 × 256               |\n| 5 × Conv dw / s1 Conv / s1 | 3 × 3 × 512 dw 1 × 1 × 512 × 512 | 14 × 14 × 512 14 × 14 × 512 |\n| Conv dw / s2               | 3 × 3 × 512 dw                   | 14 × 14 × 512               |\n| Conv / s1                  | 1 × 1 × 512 × 1024               | 7 × 7 × 512                 |\n| Conv dw / s2               | 3 × 3 × 1024 dw                  | 7 × 7 × 1024                |\n| Conv / s1                  | 1 × 1 × 1024 × 1024              | 7 × 7 × 1024                |\n| Avg Pool / s1              | Pool 7 × 7                       | 7 × 7 × 1024                |\n| FC / s1                    | 1024 × 1000                      | 1 × 1 × 1024                |\n| Softmax / s1               | Classifier                       | 1 × 1 × 1000                |\n\nTable 2. Resource Per Layer Type\n\n| Type            | Mult-Adds   | Parameters   |\n|-----------------|-------------|--------------|\n| Conv 1 × 1      | 94.86%      | 74.59%       |\n| Conv DW 3 × 3   | 3.06%       | 1.06%        |\n| Conv 3 × 3      | 1.19%       | 0.02%        |\n| Fully Connected | 0.18%       | 24.33%       |\n\nand width multiplier α , the number of input channels M becomes αM and the number of output channels N becomes αN .\n\nThe computational cost of a depthwise separable convolution with width multiplier α is:\n\n<!-- formula-not-decoded -->\n\nwhere α ∈ (0 1] , with typical settings of 1, 0.75, 0.5 and 0.25. α = 1 is the baseline MobileNet and α &lt; 1 are reduced MobileNets. Width multiplier has the effect of reducing computational cost and the number of parameters quadratically by roughly α 2 . Width multiplier can be applied to any model structure to define a new smaller model with a reasonable accuracy, latency and size trade off. It is used to define a new reduced structure that needs to be trained from scratch.",
        "metadata": {
            "section_header": "Width Multiplier: Thinner Models",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.4. Resolution Multiplier: Reduced Representation\n\nThe second hyper-parameter to reduce the computational cost of a neural network is a resolution multiplier ρ . We ap-\n\nTable 3. Resource usage for modifications to standard convolution. Note that each row is a cumulative effect adding on top of the previous row. This example is for an internal MobileNet layer with D K = 3 , M = 512 , N = 512 , D F = 14 .\n\n| Layer/Modification       |   Million Mult-Adds |   Million Parameters |\n|--------------------------|---------------------|----------------------|\n| Convolution              |               462   |                 2.36 |\n| Depthwise Separable Conv |                52.3 |                 0.27 |\n| α = 0 . 75               |                29.6 |                 0.15 |\n| ρ = 0 . 714              |                15.1 |                 0.15 |\n\nply this to the input image and the internal representation of every layer is subsequently reduced by the same multiplier. In practice we implicitly set ρ by setting the input resolution.\n\nWe can now express the computational cost for the core layers of our network as depthwise separable convolutions with width multiplier α and resolution multiplier ρ :\n\n<!-- formula-not-decoded -->\n\nwhere ρ ∈ (0 1] , which is typically set implicitly so that the input resolution of the network is 224, 192, 160 or 128. ρ = 1 is the baseline MobileNet and ρ &lt; 1 are reduced computation MobileNets. Resolution multiplier has the effect of reducing computational cost by ρ 2 .\n\nAs an example we can look at a typical layer in MobileNet and see how depthwise separable convolutions, width multiplier and resolution multiplier reduce the cost and parameters. Table 3 shows the computation and number of parameters for a layer as architecture shrinking methods are sequentially applied to the layer. The first row shows the Mult-Adds and parameters for a full convolutional layer with an input feature map of size 14 × 14 × 512 with a kernel K of size 3 × 3 × 512 × 512 . We will look in detail in the next section at the trade offs between resources and accuracy.",
        "metadata": {
            "section_header": "Resolution Multiplier: Reduced Representation",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4. Experiments\n\nIn this section we first investigate the effects of depthwise convolutions as well as the choice of shrinking by reducing the width of the network rather than the number of layers. We then show the trade offs of reducing the network based on the two hyper-parameters: width multiplier and resolution multiplier and compare results to a number of popular models. We then investigate MobileNets applied to a number of different applications.",
        "metadata": {
            "section_header": "Experiments",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.1. Model Choices\n\nFirst we show results for MobileNet with depthwise separable convolutions compared to a model built with full convolutions. In Table 4 we see that using depthwise separable convolutions compared to full convolutions only reduces\n\nTable 4. Depthwise Separable vs Full Convolution MobileNet\n\n| Model          | ImageNet Accuracy   |   Million Mult-Adds |   Million Parameters |\n|----------------|---------------------|---------------------|----------------------|\n| Conv MobileNet | 71.7%               |                4866 |                 29.3 |\n| MobileNet      | 70.6%               |                 569 |                  4.2 |\n\nTable 5. Narrow vs Shallow MobileNet\n\n| Model             | ImageNet Accuracy   |   Million Mult-Adds |   Million Parameters |\n|-------------------|---------------------|---------------------|----------------------|\n| 0.75 MobileNet    | 68.4%               |                 325 |                  2.6 |\n| Shallow MobileNet | 65.3%               |                 307 |                  2.9 |\n\nTable 6. MobileNet Width Multiplier\n\n| Width Multiplier   | ImageNet Accuracy   |   Million Mult-Adds |   Million Parameters |\n|--------------------|---------------------|---------------------|----------------------|\n| 1.0 MobileNet-224  | 70.6%               |                 569 |                  4.2 |\n| 0.75 MobileNet-224 | 68.4%               |                 325 |                  2.6 |\n| 0.5 MobileNet-224  | 63.7%               |                 149 |                  1.3 |\n| 0.25 MobileNet-224 | 50.6%               |                  41 |                  0.5 |\n\nTable 7. MobileNet Resolution\n\n| Resolution        | ImageNet Accuracy   |   Million Mult-Adds |   Million Parameters |\n|-------------------|---------------------|---------------------|----------------------|\n| 1.0 MobileNet-224 | 70.6%               |                 569 |                  4.2 |\n| 1.0 MobileNet-192 | 69.1%               |                 418 |                  4.2 |\n| 1.0 MobileNet-160 | 67.2%               |                 290 |                  4.2 |\n| 1.0 MobileNet-128 | 64.4%               |                 186 |                  4.2 |\n\naccuracy by 1% on ImageNet was saving tremendously on mult-adds and parameters.\n\nWe next show results comparing thinner models with width multiplier to shallower models using less layers. To make MobileNet shallower, the 5 layers of separable filters with feature size 14 × 14 × 512 in Table 1 are removed. Table 5 shows that at similar computation and number of parameters, that making MobileNets thinner is 3% better than making them shallower.",
        "metadata": {
            "section_header": "Model Choices",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.2. Model Shrinking Hyperparameters\n\nTable 6 shows the accuracy, computation and size trade offs of shrinking the MobileNet architecture with the width multiplier α . Accuracy drops off smoothly until the architecture is made too small at α = 0 25 . .\n\nTable 7 shows the accuracy, computation and size trade offs for different resolution multipliers by training MobileNets with reduced input resolutions. Accuracy drops off smoothly across resolution.\n\nFigure 4 shows the trade off between ImageNet Accuracy and computation for the 16 models made from the cross product of width multiplier α ∈ { 1 0 75 0 5 , . , . , 0 25 . } and resolutions { 224 192 160 128 , , , } . Results are log linear with a jump when models get very small at α = 0 25 . .\n\nFigure 4. This figure shows the trade off between computation (Mult-Adds) and accuracy on the ImageNet benchmark. Note the log linear dependence between accuracy and computation.\n\n<!-- image -->\n\nFigure 5. This figure shows the trade off between the number of parameters and accuracy on the ImageNet benchmark. The colors encode input resolutions. The number of parameters do not vary based on the input resolution.\n\n<!-- image -->\n\nFigure 5 shows the trade off between ImageNet Accuracy and number of parameters for the 16 models made from the cross product of width multiplier α ∈ { 1 0 75 0 5 , . , . , 0 25 . } and resolutions { 224 192 160 128 , , , } .\n\nTable 8 compares full MobileNet to the original GoogleNet [30] and VGG16 [27]. MobileNet is nearly as accurate as VGG16 while being 32 times smaller and 27 times less compute intensive. It is more accurate than GoogleNet while being smaller and more than 2.5 times less computation.\n\nTable 9 compares a reduced MobileNet with width multiplier α = 0 5 . and reduced resolution 160 × 160 . Reduced MobileNet is 4% better than AlexNet [19] while being 45 × smaller and 9 4 . × less compute than AlexNet. It is also 4% better than Squeezenet [12] at about the same size and 22 × less computation.\n\nTable 8. MobileNet Comparison to Popular Models\n\n| Model             | ImageNet Accuracy   |   Million Mult-Adds |   Million Parameters |\n|-------------------|---------------------|---------------------|----------------------|\n| 1.0 MobileNet-224 | 70.6%               |                 569 |                  4.2 |\n| GoogleNet         | 69.8%               |                1550 |                  6.8 |\n| VGG 16            | 71.5%               |               15300 |                138   |\n\nTable 9. Smaller MobileNet Comparison to Popular Models\n\n| Model              | ImageNet Accuracy   |   Million Mult-Adds |   Million Parameters |\n|--------------------|---------------------|---------------------|----------------------|\n| 0.50 MobileNet-160 | 60.2%               |                  76 |                 1.32 |\n| Squeezenet         | 57.5%               |                1700 |                 1.25 |\n| AlexNet            | 57.2%               |                 720 |                60    |\n\nTable 10. MobileNet for Stanford Dogs\n\n| Model              | Top-1 Accuracy   |   Million Mult-Adds |   Million Parameters |\n|--------------------|------------------|---------------------|----------------------|\n| Inception V3 [18]  | 84%              |                5000 |                 23.2 |\n| 1.0 MobileNet-224  | 83.3%            |                 569 |                  3.3 |\n| 0.75 MobileNet-224 | 81.9%            |                 325 |                  1.9 |\n| 1.0 MobileNet-192  | 81.9%            |                 418 |                  3.3 |\n| 0.75 MobileNet-192 | 80.5%            |                 239 |                  1.9 |\n\nTable 11. Performance of PlaNet using the MobileNet architecture. Percentages are the fraction of the Im2GPS test dataset that were localized within a certain distance from the ground truth. The numbers for the original PlaNet model are based on an updated version that has an improved architecture and training dataset.\n\n| Scale               | Im2GPS [7]   | PlaNet [35]   | PlaNet MobileNet   |\n|---------------------|--------------|---------------|--------------------|\n| Continent (2500 km) | 51.9%        | 77.6%         | 79.3%              |\n| Country (750 km)    | 35.4%        | 64.0%         | 60.3%              |\n| Region (200 km)     | 32.1%        | 51.1%         | 45.2%              |\n| City (25 km)        | 21.9%        | 31.7%         | 31.7%              |\n| Street (1 km)       | 2.5%         | 11.0%         | 11.4%              |",
        "metadata": {
            "section_header": "Model Shrinking Hyperparameters",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.3. Fine Grained Recognition\n\nWe train MobileNet for fine grained recognition on the Stanford Dogs dataset [17]. We extend the approach of [18] and collect an even larger but noisy training set than [18] from the web. We use the noisy web data to pretrain a fine grained dog recognition model and then fine tune the model on the Stanford Dogs training set. Results on Stanford Dogs test set are in Table 10. MobileNet can almost achieve the state of the art results from [18] at greatly reduced computation and size.",
        "metadata": {
            "section_header": "Fine Grained Recognition",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.4. Large Scale Geolocalizaton\n\nPlaNet [35] casts the task of determining where on earth a photo was taken as a classification problem. The approach divides the earth into a grid of geographic cells that serve as the target classes and trains a convolutional neural network on millions of geo-tagged photos. PlaNet has been shown to successfully localize a large variety of photos and to outperform Im2GPS [6, 7] that addresses the same task.\n\nWe re-train PlaNet using the MobileNet architecture on the same data. While the full PlaNet model based on the Inception V3 architecture [31] has 52 million parameters and 5.74 billion mult-adds. The MobileNet model has only 13 million parameters with the usual 3 million for the body and 10 million for the final layer and 0.58 Million mult-adds. As shown in Tab. 11, the MobileNet version delivers only slightly decreased performance compared to PlaNet despite being much more compact. Moreover, it still outperforms Im2GPS by a large margin.",
        "metadata": {
            "section_header": "Large Scale Geolocalizaton",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.5. Face Attributes\n\nAnother use-case for MobileNet is compressing large systems with unknown or esoteric training procedures. In a face attribute classification task, we demonstrate a synergistic relationship between MobileNet and distillation [9], a knowledge transfer technique for deep networks. We seek to reduce a large face attribute classifier with 75 million parameters and 1600 million Mult-Adds. The classifier is trained on a multi-attribute dataset similar to YFCC100M [32].\n\nWe distill a face attribute classifier using the MobileNet architecture. Distillation [9] works by training the classifier to emulate the outputs of a larger model 2 instead of the ground-truth labels, hence enabling training from large (and potentially infinite) unlabeled datasets. Marrying the scalability of distillation training and the parsimonious parameterization of MobileNet, the end system not only requires no regularization (e.g. weight-decay and early-stopping), but also demonstrates enhanced performances. It is evident from Tab. 12 that the MobileNet-based classifier is resilient to aggressive model shrinking: it achieves a similar mean average precision across attributes (mean AP) as the in-house while consuming only 1% the Multi-Adds.",
        "metadata": {
            "section_header": "Face Attributes",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.6. Object Detection\n\nMobileNet can also be deployed as an effective base network in modern object detection systems. We report results for MobileNet trained for object detection on COCO data based on the recent work that won the 2016 COCO challenge [10]. In table 13, MobileNet is compared to VGG and Inception V2 [13] under both Faster-RCNN [23] and SSD [21] framework. In our experiments, SSD is evaluated with 300 input resolution (SSD 300) and Faster-RCNN is compared with both 300 and 600 input resolution (FasterRCNN 300, Faster-RCNN 600). The Faster-RCNN model evaluates 300 RPN proposal boxes per image. The models are trained on COCO train+val excluding 8k minival images\n\n2 The emulation quality is measured by averaging the per-attribute cross-entropy over all attributes.\n\nTable 12. Face attribute classification using the MobileNet architecture. Each row corresponds to a different hyper-parameter setting (width multiplier α and image resolution).\n\n| Width Multiplier / Resolution   | Mean AP   |   Million Mult-Adds |   Million Parameters |\n|---------------------------------|-----------|---------------------|----------------------|\n| 1.0 MobileNet-224               | 88.7%     |                 568 |                  3.2 |\n| 0.5 MobileNet-224               | 88.1%     |                 149 |                  0.8 |\n| 0.25 MobileNet-224              | 87.2%     |                  45 |                  0.2 |\n| 1.0 MobileNet-128               | 88.1%     |                 185 |                  3.2 |\n| 0.5 MobileNet-128               | 87.7%     |                  48 |                  0.8 |\n| 0.25 MobileNet-128              | 86.4%     |                  15 |                  0.2 |\n| Baseline                        | 86.9%     |                1600 |                  7.5 |\n\nTable 13. COCO object detection results comparison using different frameworks and network architectures. mAP is reported with COCO primary challenge metric (AP at IoU=0.50:0.05:0.95)\n\nFigure 6. Example objection detection results using MobileNet SSD.\n\n| Framework Resolution   | Model        | mAP   |   Billion Mult-Adds |   Million Parameters |\n|------------------------|--------------|-------|---------------------|----------------------|\n| SSD 300                | deeplab-VGG  | 21.1% |                34.9 |                 33.1 |\n|                        | Inception V2 | 22.0% |                 3.8 |                 13.7 |\n|                        | MobileNet    | 19.3% |                 1.2 |                  6.8 |\n| Faster-RCNN 300        | VGG          | 22.9% |                64.3 |                138.5 |\n| Faster-RCNN 300        | Inception V2 | 15.4% |               118.2 |                 13.3 |\n| Faster-RCNN 300        | MobileNet    | 16.4% |                25.2 |                  6.1 |\n| Faster-RCNN 600        | VGG          | 25.7% |               149.6 |                138.5 |\n| Faster-RCNN 600        | Inception V2 | 21.9% |               129.6 |                 13.3 |\n| Faster-RCNN 600        | Mobilenet    | 19.8% |                30.5 |                  6.1 |\n\n<!-- image -->\n\nand evaluated on minival. For both frameworks, MobileNet achieves comparable results to other networks with only a fraction of computational complexity and model size.",
        "metadata": {
            "section_header": "Object Detection",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.7. Face Embeddings\n\nThe FaceNet model is a state of the art face recognition model [25]. It builds face embeddings based on the triplet loss. To build a mobile FaceNet model we use distillation to train by minimizing the squared differences of the output\n\nTable 14. MobileNet Distilled from FaceNet\n\n| Model              | 1e-4 Accuracy   |   Million Mult-Adds |   Million Parameters |\n|--------------------|-----------------|---------------------|----------------------|\n| FaceNet [25]       | 83%             |                1600 |                  7.5 |\n| 1.0 MobileNet-160  | 79.4%           |                 286 |                  4.9 |\n| 1.0 MobileNet-128  | 78.3%           |                 185 |                  5.5 |\n| 0.75 MobileNet-128 | 75.2%           |                 166 |                  3.4 |\n| 0.75 MobileNet-128 | 72.5%           |                 108 |                  3.8 |\n\nof FaceNet and MobileNet on the training data. Results for very small MobileNet models can be found in table 14.",
        "metadata": {
            "section_header": "Face Embeddings",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    },
    {
        "page_content": "## 5. Conclusion\n\nWe proposed a new model architecture called MobileNets based on depthwise separable convolutions. We investigated some of the important design decisions leading to an efficient model. We then demonstrated how to build smaller and faster MobileNets using width multiplier and resolution multiplier by trading off a reasonable amount of accuracy to reduce size and latency. We then compared different MobileNets to popular models demonstrating superior size, speed and accuracy characteristics. We concluded by demonstrating MobileNet's effectiveness when applied to a wide variety of tasks. As a next step to help adoption and exploration of MobileNets, we plan on releasing models in Tensor Flow.",
        "metadata": {
            "section_header": "Conclusion",
            "title": "MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications",
            "type": "paper"
        }
    }
]