[
    {
        "page_content": "## ABSTRACT\n\nTree boosting is a highly effective and widely used machine learning method. In this paper, we describe a scalable endto-end tree boosting system called XGBoost, which is used widely by data scientists to achieve state-of-the-art results on many machine learning challenges. We propose a novel sparsity-aware algorithm for sparse data and weighted quantile sketch for approximate tree learning. More importantly, we provide insights on cache access patterns, data compression and sharding to build a scalable tree boosting system. By combining these insights, XGBoost scales beyond billions of examples using far fewer resources than existing systems.",
        "metadata": {
            "section_header": "ABSTRACT",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## Keywords\n\nLarge-scale Machine Learning",
        "metadata": {
            "section_header": "Keywords",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1. INTRODUCTION\n\nMachine learning and data-driven approaches are becoming very important in many areas. Smart spam classifiers protect our email by learning from massive amounts of spam data and user feedback; advertising systems learn to match the right ads with the right context; fraud detection systems protect banks from malicious attackers; anomaly event detection systems help experimental physicists to find events that lead to new physics. There are two important factors that drive these successful applications: usage of effective (statistical) models that capture the complex data dependencies and scalable learning systems that learn the model of interest from large datasets.\n\nAmong the machine learning methods used in practice, gradient tree boosting [10] 1 is one technique that shines in many applications. Tree boosting has been shown to give state-of-the-art results on many standard classification benchmarks [16]. LambdaMART [5], a variant of tree boosting for ranking, achieves state-of-the-art result for ranking\n\n1 Gradient tree boosting is also known as gradient boosting machine (GBM) or gradient boosted regression tree (GBRT)\n\nPermission to make digital or hard copies of part or all of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for third-party components of this work must be honored. For all other uses, contact the owner/author(s).\n\nKDD '16, August 13-17, 2016, San Francisco, CA, USA c © 2016 Copyright held by the owner/author(s). ACM ISBN .\n\nproblems. Besides being used as a stand-alone predictor, it is also incorporated into real-world production pipelines for ad click through rate prediction [15]. Finally, it is the defacto choice of ensemble method and is used in challenges such as the Netflix prize [3].\n\nIn this paper, we describe XGBoost, a scalable machine learning system for tree boosting. The system is available as an open source package . The impact of the system has been 2 widely recognized in a number of machine learning and data mining challenges. Take the challenges hosted by the machine learning competition site Kaggle for example. Among the 29 challenge winning solutions 3 published at Kaggle's blog during 2015, 17 solutions used XGBoost. Among these solutions, eight solely used XGBoost to train the model, while most others combined XGBoost with neural nets in ensembles. For comparison, the second most popular method, deep neural nets, was used in 11 solutions. The success of the system was also witnessed in KDDCup 2015, where XGBoost was used by every winning team in the top-10. Moreover, the winning teams reported that ensemble methods outperform a well-configured XGBoost by only a small amount [1].\n\nThese results demonstrate that our system gives state-ofthe-art results on a wide range of problems. Examples of the problems in these winning solutions include: store sales prediction; high energy physics event classification; web text classification; customer behavior prediction; motion detection; ad click through rate prediction; malware classification; product categorization; hazard risk prediction; massive online course dropout rate prediction. While domain dependent data analysis and feature engineering play an important role in these solutions, the fact that XGBoost is the consensus choice of learner shows the impact and importance of our system and tree boosting.\n\nThe most important factor behind the success of XGBoost is its scalability in all scenarios. The system runs more than ten times faster than existing popular solutions on a single machine and scales to billions of examples in distributed or memory-limited settings. The scalability of XGBoost is due to several important systems and algorithmic optimizations. These innovations include: a novel tree learning algorithm is for handling sparse data ; a theoretically justified weighted quantile sketch procedure enables handling instance weights in approximate tree learning. Parallel and distributed computing makes learning faster which enables quicker model exploration. More importantly, XGBoost exploits out-of-core\n\n2 https://github.com/dmlc/xgboost\n\n3 Solutions come from of top-3 teams of each competitions.\n\ncomputation and enables data scientists to process hundred millions of examples on a desktop. Finally, it is even more exciting to combine these techniques to make an end-to-end system that scales to even larger data with the least amount of cluster resources. The major contributions of this paper is listed as follows:\n\n- · We design and build a highly scalable end-to-end tree boosting system.\n- · We propose a theoretically justified weighted quantile sketch for efficient proposal calculation.\n- · We introduce a novel sparsity-aware algorithm for parallel tree learning.\n- · We propose an effective cache-aware block structure for out-of-core tree learning.\n\nWhile there are some existing works on parallel tree boosting [22, 23, 19], the directions such as out-of-core computation, cache-aware and sparsity-aware learning have not been explored. More importantly, an end-to-end system that combines all of these aspects gives a novel solution for real-world use-cases. This enables data scientists as well as researchers to build powerful variants of tree boosting algorithms [7, 8]. Besides these major contributions, we also make additional improvements in proposing a regularized learning objective, which we will include for completeness.\n\nThe remainder of the paper is organized as follows. We will first review tree boosting and introduce a regularized objective in Sec. 2. We then describe the split finding methods in Sec. 3 as well as the system design in Sec. 4, including experimental results when relevant to provide quantitative support for each optimization we describe. Related work is discussed in Sec. 5. Detailed end-to-end evaluations are included in Sec. 6. Finally we conclude the paper in Sec. 7.",
        "metadata": {
            "section_header": "INTRODUCTION",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 2. TREE BOOSTING IN A NUTSHELL\n\nWe review gradient tree boosting algorithms in this section. The derivation follows from the same idea in existing literatures in gradient boosting. Specicially the second order method is originated from Friedman et al. [12]. We make minor improvements in the reguralized objective, which were found helpful in practice.",
        "metadata": {
            "section_header": "TREE BOOSTING IN A NUTSHELL",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 2.1 Regularized Learning Objective\n\nFor a given data set with n examples and m features D = { ( x i , y i ) } ( |D| = n, x i ∈ R m , y i ∈ R ), a tree ensemble model (shown in Fig. 1) uses K additive functions to predict the output.\n\n<!-- formula-not-decoded -->\n\nwhere F = { f ( x ) = w q ( x ) } ( q : R m → T, w ∈ R T ) is the space of regression trees (also known as CART). Here q represents the structure of each tree that maps an example to the corresponding leaf index. T is the number of leaves in the tree. Each f k corresponds to an independent tree structure q and leaf weights w . Unlike decision trees, each regression tree contains a continuous score on each of the leaf, we use w i to represent score on i -th leaf. For a given example, we will use the decision rules in the trees (given by q ) to classify\n\nFigure 1: Tree Ensemble Model. The final prediction for a given example is the sum of predictions from each tree.\n\n<!-- image -->\n\nit into the leaves and calculate the final prediction by summing up the score in the corresponding leaves (given by w ). To learn the set of functions used in the model, we minimize the following regularized objective.\n\n<!-- formula-not-decoded -->\n\nHere l is a differentiable convex loss function that measures the difference between the prediction ˆ y i and the target y i . The second term Ω penalizes the complexity of the model (i.e., the regression tree functions). The additional regularization term helps to smooth the final learnt weights to avoid over-fitting. Intuitively, the regularized objective will tend to select a model employing simple and predictive functions. A similar regularization technique has been used in Regularized greedy forest (RGF) [25] model. Our objective and the corresponding learning algorithm is simpler than RGF and easier to parallelize. When the regularization parameter is set to zero, the objective falls back to the traditional gradient tree boosting.",
        "metadata": {
            "section_header": "Regularized Learning Objective",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 2.2 Gradient Tree Boosting\n\nThe tree ensemble model in Eq. (2) includes functions as parameters and cannot be optimized using traditional optimization methods in Euclidean space. Instead, the model is trained in an additive manner. Formally, let ˆ y ( ) t i be the prediction of the i -th instance at the t -th iteration, we will need to add f t to minimize the following objective.\n\n<!-- formula-not-decoded -->\n\nThis means we greedily add the f t that most improves our model according to Eq. (2). Second-order approximation can be used to quickly optimize the objective in the general setting [12].\n\n<!-- formula-not-decoded -->\n\nwhere g i = ∂ ˆ y ( t -1) l ( y , y i ˆ ( t -1) ) and h i = ∂ 2 ˆ y ( t -1) l ( y , y i ˆ ( t -1) ) are first and second order gradient statistics on the loss function. We can remove the constant terms to obtain the following simplified objective at step t .\n\n<!-- formula-not-decoded -->\n\nFigure 2: Structure Score Calculation. We only need to sum up the gradient and second order gradient statistics on each leaf, then apply the scoring formula to get the quality score.\n\n<!-- image -->\n\nDefine I j = { | i q ( x i ) = j } as the instance set of leaf j . We can rewrite Eq (3) by expanding Ω as follows\n\n<!-- formula-not-decoded -->\n\nFor a fixed structure q ( x ), we can compute the optimal weight w ∗ j of leaf j by\n\n<!-- formula-not-decoded -->\n\nand calculate the corresponding optimal value by\n\n<!-- formula-not-decoded -->\n\nEq (6) can be used as a scoring function to measure the quality of a tree structure q . This score is like the impurity score for evaluating decision trees, except that it is derived for a wider range of objective functions. Fig. 2 illustrates how this score can be calculated.\n\nNormally it is impossible to enumerate all the possible tree structures q . A greedy algorithm that starts from a single leaf and iteratively adds branches to the tree is used instead. Assume that I L and I R are the instance sets of left and right nodes after the split. Lettting I = I L ∪ I R , then the loss reduction after the split is given by\n\n<!-- formula-not-decoded -->\n\nThis formula is usually used in practice for evaluating the split candidates.",
        "metadata": {
            "section_header": "Gradient Tree Boosting",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 2.3 Shrinkage and Column Subsampling\n\nBesides the regularized objective mentioned in Sec. 2.1, two additional techniques are used to further prevent overfitting. The first technique is shrinkage introduced by Friedman [11]. Shrinkage scales newly added weights by a factor η after each step of tree boosting. Similar to a learning rate in tochastic optimization, shrinkage reduces the influence of each individual tree and leaves space for future trees to improve the model. The second technique is column (feature) subsampling. This technique is used in RandomForest [4,",
        "metadata": {
            "section_header": "Shrinkage and Column Subsampling",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## Algorithm 1: Exact Greedy Algorithm for Split Finding\n\n:\n\nInput\n\nI\n\n,\n\ninstance set of current node\n\n:\n\nInput gain\n\n←\n\nG\n\n←\n\nfor\n\nk\n\nd\n\n,\n\n0\n\n∑\n\ni\n\n∈\n\n= 1\n\nG\n\nL\n\n←\n\nfor feature dimension\n\ng\n\n∑\n\nI\n\ni\n\n,\n\nH\n\n←\n\nh\n\ni\n\nto\n\nm\n\ndo\n\n0\n\n,\n\nH\n\nL\n\n←\n\nj\n\ni\n\n∈\n\n0\n\nin sorted(\n\nG\n\nI\n\nL\n\n←\n\nG\n\nL\n\n+\n\nG\n\nR\n\n←\n\nscore\n\nG\n\n←\n\nend end\n\nOutput : Split with max score\n\nAlgorithm 2: Approximate Algorithm for Split Finding for k = 1 to m do\n\nPropose S k = { s k 1 , s k 2 , · · · s kl } by percentiles on feature k . Proposal can be done per tree (global), or per split(local).\n\nend\n\n<!-- formula-not-decoded -->\n\nFollow same step as in previous section to find max score only among proposed splits.\n\n13], It is implemented in a commercial software TreeNet 4 for gradient boosting, but is not implemented in existing opensource packages. According to user feedback, using column sub-sampling prevents over-fitting even more so than the traditional row sub-sampling (which is also supported). The usage of column sub-samples also speeds up computations of the parallel algorithm described later.",
        "metadata": {
            "section_header": "Algorithm 1: Exact Greedy Algorithm for Split Finding",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3. SPLIT FINDING ALGORITHMS",
        "metadata": {
            "section_header": "SPLIT FINDING ALGORITHMS",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.1 Basic Exact Greedy Algorithm\n\nOne of the key problems in tree learning is to find the best split as indicated by Eq (7). In order to do so, a split finding algorithm enumerates over all the possible splits on all the features. We call this the exact greedy algorithm . Most existing single machine tree boosting implementations, such as scikit-learn [20], R's gbm [21] as well as the single machine version of XGBoost support the exact greedy algorithm. The exact greedy algorithm is shown in Alg. 1. It is computationally demanding to enumerate all the possible splits for continuous features. In order to do so efficiently, the algorithm must first sort the data according to feature values and visit the data in sorted order to accumulate the gradient statistics for the structure score in Eq (7).",
        "metadata": {
            "section_header": "Basic Exact Greedy Algorithm",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.2 Approximate Algorithm\n\nThe exact greedy algorithm is very powerful since it enumerates over all possible splitting points greedily. However, it is impossible to efficiently do so when the data does not fit entirely into memory. Same problem also arises in the dis-\n\n4 https://www.salford-systems.com/products/treenet\n\n,\n\nby\n\nI\n\nx\n\ng ,\n\nj\n\nH\n\n-\n\njk\n\nL\n\nG , H\n\nL\n\nmax(\n\n)\n\n←\n\nR\n\nscore, do\n\nH\n\nL\n\n←\n\nH\n\nG\n\nH\n\nL\n\n+\n\n-\n\n2\n\nL\n\n+\n\nh\n\nH\n\n+\n\nj\n\nL\n\nG\n\n2\n\nR\n\nH\n\nR\n\n+\n\nλ\n\nλ\n\n-\n\nG\n\n2\n\nH\n\n+\n\nλ\n\n)\n\nFigure 3: Comparison of test AUC convergence on Higgs 10M dataset. The eps parameter corresponds to the accuracy of the approximate sketch. This roughly translates to 1 / eps buckets in the proposal. We find that local proposals require fewer buckets, because it refine split candidates.\n\n<!-- image -->\n\ntributed setting. To support effective gradient tree boosting in these two settings, an approximate algorithm is needed.\n\nWe summarize an approximate framework, which resembles the ideas proposed in past literatures [17, 2, 22], in Alg. 2. To summarize, the algorithm first proposes candidate splitting points according to percentiles of feature distribution (a specific criteria will be given in Sec. 3.3). The algorithm then maps the continuous features into buckets split by these candidate points, aggregates the statistics and finds the best solution among proposals based on the aggregated statistics.\n\nThere are two variants of the algorithm, depending on when the proposal is given. The global variant proposes all the candidate splits during the initial phase of tree construction, and uses the same proposals for split finding at all levels. The local variant re-proposes after each split. The global method requires less proposal steps than the local method. However, usually more candidate points are needed for the global proposal because candidates are not refined after each split. The local proposal refines the candidates after splits, and can potentially be more appropriate for deeper trees. A comparison of different algorithms on a Higgs boson dataset is given by Fig. 3. We find that the local proposal indeed requires fewer candidates. The global proposal can be as accurate as the local one given enough candidates.\n\nMost existing approximate algorithms for distributed tree learning also follow this framework. Notably, it is also possible to directly construct approximate histograms of gradient statistics [22]. It is also possible to use other variants of binning strategies instead of quantile [17]. Quantile strategy benefit from being distributable and recomputable, which we will detail in next subsection. From Fig. 3, we also find that the quantile strategy can get the same accuracy as exact greedy given reasonable approximation level.\n\nOur system efficiently supports exact greedy for the single machine setting, as well as approximate algorithm with both local and global proposal methods for all settings. Users can freely choose between the methods according to their needs.",
        "metadata": {
            "section_header": "Approximate Algorithm",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.3 Weighted Quantile Sketch\n\nOne important step in the approximate algorithm is to propose candidate split points. Usually percentiles of a fea-\n\nFigure 4: Tree structure with default directions. An example will be classified into the default direction when the feature needed for the split is missing.\n\n<!-- image -->\n\nture are used to make candidates distribute evenly on the data. Formally, let multi-set D k = ( { x 1 k , h 1 ) , ( x 2 k , h 2 ) · · · ( x nk , h n ) } represent the k -th feature values and second order gradient statistics of each training instances. We can define a rank functions r k : R → [0 , + ∞ ) as\n\n<!-- formula-not-decoded -->\n\nwhich represents the proportion of instances whose feature value k is smaller than z . The goal is to find candidate split points { s k 1 , s k 2 , · · · s kl } , such that\n\n<!-- formula-not-decoded -->\n\nHere glyph[epsilon1] is an approximation factor. Intuitively, this means that there is roughly 1 /glyph[epsilon1] candidate points. Here each data point is weighted by h i . To see why h i represents the weight, we can rewrite Eq (3) as\n\n<!-- formula-not-decoded -->\n\nwhich is exactly weighted squared loss with labels g /h i i and weights h i . For large datasets, it is non-trivial to find candidate splits that satisfy the criteria. When every instance has equal weights, an existing algorithm called quantile sketch [14, 24] solves the problem. However, there is no existing quantile sketch for the weighted datasets. Therefore, most existing approximate algorithms either resorted to sorting on a random subset of data which have a chance of failure or heuristics that do not have theoretical guarantee.\n\nTo solve this problem, we introduced a novel distributed weighted quantile sketch algorithm that can handle weighted data with a provable theoretical guarantee . The general idea is to propose a data structure that supports merge and prune operations, with each operation proven to maintain a certain accuracy level. A detailed description of the algorithm as well as proofs are given in the appendix.",
        "metadata": {
            "section_header": "Weighted Quantile Sketch",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.4 Sparsity-aware Split Finding\n\nIn many real-world problems, it is quite common for the input x to be sparse. There are multiple possible causes for sparsity: 1) presence of missing values in the data; 2) frequent zero entries in the statistics; and, 3) artifacts of feature engineering such as one-hot encoding. It is important to make the algorithm aware of the sparsity pattern in the data. In order to do so, we propose to add a default direction in each tree node, which is shown in Fig. 4. When a value is missing in the sparse matrix x , the instance is classified into the default direction. There are two choices\n\nFigure 6: Block structure for parallel learning. Each column in a block is sorted by the corresponding feature value. A linear scan over one column in the block is sufficient to enumerate all the split points.\n\n<!-- image -->",
        "metadata": {
            "section_header": "Sparsity-aware Split Finding",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## Algorithm 3: Sparsity-aware Split Finding\n\nInput : I , instance set of current node glyph[negationslash]\n\nInput : I k = { i ∈ I x | ik = missing }\n\nInput : d , feature dimension\n\nAlso applies to the approximate setting, only collect statistics of non-missing entries into buckets\n\ngain ← 0\n\nG\n\n←\n\n∑\n\n∈\n\ni\n\nI\n\n, g\n\ni\n\n,\n\nH\n\n←\n\ni\n\n∈\n\nI\n\nh\n\ni\n\nfor k = 1 to m do\n\n// enumerate missing value goto right\n\nG\n\nL\n\n←\n\n0\n\n,\n\nH\n\nL\n\n←\n\n0\n\n<!-- image -->\n\nfor\n\nj\n\nin sorted(\n\nG\n\nI\n\nL\n\n←\n\nG\n\nL\n\n+\n\nG\n\nR\n\n←\n\nscore\n\nG\n\n←\n\nk\n\n,\n\nascent order by g ,\n\nj\n\nH\n\n-\n\nL\n\n←\n\nH\n\nL\n\n+\n\nh\n\nG , H\n\nL\n\nmax(\n\nR\n\nscore,\n\n←\n\nH\n\nG\n\nH\n\nL\n\n-\n\n2\n\nL\n\n+\n\nλ\n\nH\n\n+\n\nj\n\nL\n\nG\n\n2\n\nR\n\nH\n\nR\n\n+\n\nend\n\n// enumerate missing value goto left\n\nG\n\nR\n\n←\n\n0\n\n,\n\nH\n\nR\n\n←\n\n0\n\nfor\n\nj\n\nin sorted(\n\nG\n\nI\n\nR\n\n←\n\nG\n\nR\n\n+\n\nG\n\nL\n\n←\n\nscore\n\nG\n\n←\n\nend end\n\nOutput : Split and default directions with max gain of default direction in each branch. The optimal default directions are learnt from the data. The algorithm is shown in Alg. 3. The key improvement is to only visit the non-missing entries I k . The presented algorithm treats the non-presence as a missing value and learns the best direction to handle missing values. The same algorithm can also be applied when the non-presence corresponds to a user specified value by limiting the enumeration only to consistent solutions.\n\nTo the best of our knowledge, most existing tree learning algorithms are either only optimized for dense data, or need specific procedures to handle limited cases such as categorical encoding. XGBoost handles all sparsity patterns in a unified way. More importantly, our method exploits the sparsity to make computation complexity linear to number of non-missing entries in the input. Fig. 5 shows the comparison of sparsity aware and a naive implementation on an Allstate-10K dataset (description of dataset given in Sec. 6). We find that the sparsity aware algorithm runs 50 times faster than the naive version. This confirms the importance of the sparsity aware algorithm.\n\nk\n\n,\n\ndescent order by g ,\n\nj\n\nH\n\n-\n\nR\n\n←\n\nH\n\nR\n\n+\n\nh\n\nj\n\nG , H\n\nR\n\nmax(\n\nL\n\nscore,\n\n←\n\nH\n\nG\n\nH\n\nL\n\n-\n\n2\n\nL\n\n+\n\nH\n\n+\n\nR\n\nG\n\nx\n\nλ\n\n)\n\ndo\n\n-\n\njk\n\n2\n\nR\n\nH\n\nR\n\n+\n\n)\n\n-\n\nG\n\n2\n\nH\n\n+\n\nλ\n\ndo\n\nG\n\n2\n\nH\n\n+\n\nλ\n\nx\n\njk\n\nFigure 5: Impact of the sparsity aware algorithm on Allstate-10K. The dataset is sparse mainly due to one-hot encoding. The sparsity aware algorithm is more than 50 times faster than the naive version that does not take sparsity into consideration.",
        "metadata": {
            "section_header": "Algorithm 3: Sparsity-aware Split Finding",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4. SYSTEM DESIGN",
        "metadata": {
            "section_header": "SYSTEM DESIGN",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.1 Column Block for Parallel Learning\n\nThe most time consuming part of tree learning is to get the data into sorted order. In order to reduce the cost of sorting, we propose to store the data in in-memory units, which we called block . Data in each block is stored in the compressed column (CSC) format, with each column sorted by the corresponding feature value. This input data layout only needs to be computed once before training, and can be reused in later iterations.\n\nIn the exact greedy algorithm, we store the entire dataset in a single block and run the split search algorithm by linearly scanning over the pre-sorted entries. We do the split finding of all leaves collectively, so one scan over the block will collect the statistics of the split candidates in all leaf branches. Fig. 6 shows how we transform a dataset into the format and find the optimal split using the block structure.\n\nThe block structure also helps when using the approximate algorithms. Multiple blocks can be used in this case, with each block corresponding to subset of rows in the dataset. Different blocks can be distributed across machines, or stored on disk in the out-of-core setting. Using the sorted structure, the quantile finding step becomes a linear scan over the sorted columns. This is especially valuable for local proposal algorithms, where candidates are generated frequently at each branch. The binary search in histogram aggregation also becomes a linear time merge style algorithm.\n\nCollecting statistics for each column can be parallelized , giving us a parallel algorithm for split finding. Importantly, the column block structure also supports column subsampling, as it is easy to select a subset of columns in a block.\n\n∑\n\nλ\n\nλ\n\n)\n\n)\n\nFigure 7: Impact of cache-aware prefetching in exact greedy algorithm. We find that the cache-miss effect impacts the performance on the large datasets (10 million instances). Using cache aware prefetching improves the performance by factor of two when the dataset is large.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nFigure 8: Short range data dependency pattern that can cause stall due to cache miss.\n\n<!-- image -->\n\nTime Complexity Analysis Let d be the maximum depth of the tree and K be total number of trees. For the exact greedy algorithm, the time complexity of original spase aware algorithm is O Kd ( ‖ x ‖ 0 log n ). Here we use ‖ x ‖ 0 to denote number of non-missing entries in the training data. On the other hand, tree boosting on the block structure only cost O Kd ( ‖ x ‖ 0 + ‖ x ‖ 0 log n ). Here O ( ‖ x ‖ 0 log n ) is the one time preprocessing cost that can be amortized. This analysis shows that the block structure helps to save an additional log n factor, which is significant when n is large. For the approximate algorithm, the time complexity of original algorithm with binary search is O Kd ( ‖ x ‖ 0 log q ). Here q is the number of proposal candidates in the dataset. While q is usually between 32 and 100, the log factor still introduces overhead. Using the block structure, we can reduce the time to O Kd ( ‖ x ‖ 0 + ‖ x ‖ 0 log B ), where B is the maximum number of rows in each block. Again we can save the additional log q factor in computation.",
        "metadata": {
            "section_header": "Column Block for Parallel Learning",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.2 Cache-aware Access\n\nWhile the proposed block structure helps optimize the computation complexity of split finding, the new algorithm requires indirect fetches of gradient statistics by row index, since these values are accessed in order of feature. This is a non-continuous memory access. A naive implementation of split enumeration introduces immediate read/write dependency between the accumulation and the non-continuous memory fetch operation (see Fig. 8). This slows down split finding when the gradient statistics do not fit into CPU cache and cache miss occur.\n\nFor the exact greedy algorithm, we can alleviate the problem by a cache-aware prefetching algorithm. Specifically, we allocate an internal buffer in each thread, fetch the gradient statistics into it, and then perform accumulation in a mini-batch manner. This prefetching changes the direct read/write dependency to a longer dependency and helps to reduce the runtime overhead when number of rows in the is large. Figure 7 gives the comparison of cache-aware vs.\n\n<!-- image -->\n\n(a) Allstate 10M\n\nFigure 9: The impact of block size in the approximate algorithm. We find that overly small blocks results in inefficient parallelization, while overly large blocks also slows down training due to cache misses.\n\n<!-- image -->\n\nnon cache-aware algorithm on the the Higgs and the Allstate dataset. We find that cache-aware implementation of the exact greedy algorithm runs twice as fast as the naive version when the dataset is large.\n\nFor approximate algorithms, we solve the problem by choosing a correct block size. We define the block size to be maximum number of examples in contained in a block, as this reflects the cache storage cost of gradient statistics. Choosing an overly small block size results in small workload for each thread and leads to inefficient parallelization. On the other hand, overly large blocks result in cache misses, as the gradient statistics do not fit into the CPU cache. A good choice of block size balances these two factors. We compared various choices of block size on two data sets. The results are given in Fig. 9. This result validates our discussion and\n\nTable 1: Comparison of major tree boosting systems.\n\n| System       | exact greedy   | approximate global   | approximate local   | out-of-core   | sparsity aware   | parallel   |\n|--------------|----------------|----------------------|---------------------|---------------|------------------|------------|\n| XGBoost      | yes            | yes                  | yes                 | yes           | yes              | yes        |\n| pGBRT        | no             | no                   | yes                 | no            | no               | yes        |\n| Spark MLLib  | no             | yes                  | no                  | no            | partially        | yes        |\n| H2O          | no             | yes                  | no                  | no            | partially        | yes        |\n| scikit-learn | yes            | no                   | no                  | no            | no               | no         |\n| R GBM        | yes            | no                   | no                  | no            | partially        | no         |\n\nshows that choosing 2 16 examples per block balances the cache property and parallelization.",
        "metadata": {
            "section_header": "Cache-aware Access",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.3 Blocks for Out-of-core Computation\n\nOne goal of our system is to fully utilize a machine's resources to achieve scalable learning. Besides processors and memory, it is important to utilize disk space to handle data that does not fit into main memory. To enable out-of-core computation, we divide the data into multiple blocks and store each block on disk. During computation, it is important to use an independent thread to pre-fetch the block into a main memory buffer, so computation can happen in concurrence with disk reading. However, this does not entirely solve the problem since the disk reading takes most of the computation time. It is important to reduce the overhead and increase the throughput of disk IO. We mainly use two techniques to improve the out-of-core computation.\n\nThere are several existing works on parallelizing tree learning [22, 19]. Most of these algorithms fall into the approximate framework described in this paper. Notably, it is also possible to partition data by columns [23] and apply the exact greedy algorithm. This is also supported in our framework, and the techniques such as cache-aware prefecthing can be used to benefit this type of algorithm. While most existing works focus on the algorithmic aspect of parallelization, our work improves in two unexplored system directions: out-of-core computation and cache-aware learning. This gives us insights on how the system and the algorithm can be jointly optimized and provides an end-to-end system that can handle large scale problems with very limited computing resources. We also summarize the comparison between our system and existing opensource implementations in Table 1.\n\nBlock Compression The first technique we use is block compression. The block is compressed by columns, and decompressed on the fly by an independent thread when loading into main memory. This helps to trade some of the computation in decompression with the disk reading cost. We use a general purpose compression algorithm for compressing the features values. For the row index, we substract the row index by the begining index of the block and use a 16bit integer to store each offset. This requires 2 16 examples per block, which is confirmed to be a good setting. In most of the dataset we tested, we achieve roughly a 26% to 29% compression ratio.\n\nBlock Sharding The second technique is to shard the data onto multiple disks in an alternative manner. A pre-fetcher thread is assigned to each disk and fetches the data into an in-memory buffer. The training thread then alternatively reads the data from each buffer. This helps to increase the throughput of disk reading when multiple disks are available.",
        "metadata": {
            "section_header": "Blocks for Out-of-core Computation",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6. END TO END EVALUATIONS",
        "metadata": {
            "section_header": "END TO END EVALUATIONS",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.1 System Implementation\n\nWe implemented XGBoost as an open source package . 5 The package is portable and reusable. It supports various weighted classification and rank objective functions, as well as user defined objective function. It is available in popular languages such as python, R, Julia and integrates naturally with language native data science pipelines such as scikitlearn. The distributed version is built on top of the rabit library 6 for allreduce. The portability of XGBoost makes it available in many ecosystems, instead of only being tied to a specific platform. The distributed XGBoost runs natively on Hadoop, MPI Sun Grid engine. Recently, we also enable distributed XGBoost on jvm bigdata stacks such as Flink and Spark. The distributed version has also been integrated into cloud platform Tianchi 7 of Alibaba. We believe that there will be more integrations in the future.",
        "metadata": {
            "section_header": "System Implementation",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.2 Dataset and Setup\n\n5 https://github.com/dmlc/xgboost\n\n6 https://github.com/dmlc/rabit\n\n7 https://tianchi.aliyun.com\n\nTable 2: Dataset used in the Experiments.\n\n| Dataset     | n     |    m | Task                           |\n|-------------|-------|------|--------------------------------|\n| Allstate    | 10 M  | 4227 | Insurance claim classification |\n| Higgs Boson | 10 M  |   28 | Event classification           |\n| Yahoo LTRC  | 473K  |  700 | Learning to Rank               |\n| Criteo      | 1.7 B |   67 | Click through rate prediction  |\n\nWe used four datasets in our experiments. A summary of these datasets is given in Table 2. In some of the experiments, we use a randomly selected subset of the data either due to slow baselines or to demonstrate the performance of the algorithm with varying dataset size. We use a suffix to denote the size in these cases. For example Allstate-10K means a subset of the Allstate dataset with 10K instances.\n\nThe first dataset we use is the Allstate insurance claim dataset . 8 The task is to predict the likelihood and cost of an insurance claim given different risk factors. In the experiment, we simplified the task to only predict the likelihood of an insurance claim. This dataset is used to evaluate the impact of sparsity-aware algorithm in Sec. 3.4. Most of the sparse features in this data come from one-hot encoding. We randomly select 10M instances as training set and use the rest as evaluation set.\n\nThe second dataset is the Higgs boson dataset 9 from high energy physics. The data was produced using Monte Carlo simulations of physics events. It contains 21 kinematic properties measured by the particle detectors in the accelerator. It also contains seven additional derived physics quantities of the particles. The task is to classify whether an event corresponds to the Higgs boson. We randomly select 10M instances as training set and use the rest as evaluation set.\n\nThe third dataset is the Yahoo! learning to rank challenge dataset [6], which is one of the most commonly used benchmarks in learning to rank algorithms. The dataset contains 20K web search queries, with each query corresponding to a list of around 22 documents. The task is to rank the documents according to relevance of the query. We use the official train test split in our experiment.\n\nThe last dataset is the criteo terabyte click log dataset 10 . We use this dataset to evaluate the scaling property of the system in the out-of-core and the distributed settings. The data contains 13 integer features and 26 ID features of user, item and advertiser information. Since a tree based model is better at handling continuous features, we preprocess the data by calculating the statistics of average CTR and count of ID features on the first ten days, replacing the ID features by the corresponding count statistics during the next ten days for training. The training set after preprocessing contains 1.7 billion instances with 67 features (13 integer, 26 average CTR statistics and 26 counts). The entire dataset is more than one terabyte in LibSVM format.\n\nWe use the first three datasets for the single machine parallel setting, and the last dataset for the distributed and out-of-core settings. All the single machine experiments are conducted on a Dell PowerEdge R420 with two eight-core Intel Xeon (E5-2470) (2.3GHz) and 64GB of memory. If not specified, all the experiments are run using all the avail-\n\n8 9\n\nhttps://www.kaggle.com/c/ClaimPredictionChallenge\n\nhttps://archive.ics.uci.edu/ml/datasets/HIGGS\n\n10 http://labs.criteo.com/downloads/download-terabyteclick-logs/\n\nTable 3: Comparison of Exact Greedy Methods with 500 trees on Higgs-1M data.\n\n| Method                  |   Time per Tree (sec) |   Test AUC |\n|-------------------------|-----------------------|------------|\n| XGBoost                 |                0.6841 |     0.8304 |\n| XGBoost (colsample=0.5) |                0.6401 |     0.8245 |\n| scikit-learn            |               28.51   |     0.8302 |\n| R.gbm                   |                1.032  |     0.6224 |\n\nFigure 10: Comparison between XGBoost and pGBRT on Yahoo LTRC dataset.\n\n<!-- image -->\n\nTable 4: Comparison of Learning to Rank with 500 trees on Yahoo! LTRC Dataset\n\n| Method                  |   Time per Tree (sec) |   NDCG@10 |\n|-------------------------|-----------------------|-----------|\n| XGBoost                 |                 0.826 |    0.7892 |\n| XGBoost (colsample=0.5) |                 0.506 |    0.7913 |\n| pGBRT [22]              |                 2.576 |    0.7915 |\n\nable cores in the machine. The machine settings of the distributed and the out-of-core experiments will be described in the corresponding section. In all the experiments, we boost trees with a common setting of maximum depth equals 8, shrinkage equals 0.1 and no column subsampling unless explicitly specified. We can find similar results when we use other settings of maximum depth.",
        "metadata": {
            "section_header": "Dataset and Setup",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.3 Classification\n\nIn this section, we evaluate the performance of XGBoost on a single machine using the exact greedy algorithm on Higgs-1M data, by comparing it against two other commonly used exact greedy tree boosting implementations. Since scikit-learn only handles non-sparse input, we choose the dense Higgs dataset for a fair comparison. We use the 1M subset to make scikit-learn finish running in reasonable time. Among the methods in comparison, R's GBM uses a greedy approach that only expands one branch of a tree, which makes it faster but can result in lower accuracy, while both scikit-learn and XGBoost learn a full tree. The results are shown in Table 3. Both XGBoost and scikit-learn give better performance than R's GBM, while XGBoost runs more than 10x faster than scikit-learn. In this experiment, we also find column subsamples gives slightly worse performance than using all the features. This could due to the fact that there are few important features in this dataset and we can benefit from greedily select from all the features.",
        "metadata": {
            "section_header": "Classification",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.4 Learning to Rank\n\nWe next evaluate the performance of XGBoost on the\n\nFigure 11: Comparison of out-of-core methods on different subsets of criteo data. The missing data points are due to out of disk space. We can find that basic algorithm can only handle 200M examples. Adding compression gives 3x speedup, and sharding into two disks gives another 2x speedup. The system runs out of file cache start from 400M examples. The algorithm really has to rely on disk after this point. The compression+shard method has a less dramatic slowdown when running out of file cache, and exhibits a linear trend afterwards.\n\n<!-- image -->\n\nlearning to rank problem. We compare against pGBRT [22], the best previously pubished system on this task. XGBoost runs exact greedy algorithm, while pGBRT only support an approximate algorithm. The results are shown in Table 4 and Fig. 10. We find that XGBoost runs faster. Interestingly, subsampling columns not only reduces running time, and but also gives a bit higher performance for this problem. This could due to the fact that the subsampling helps prevent overfitting, which is observed by many of the users.",
        "metadata": {
            "section_header": "Learning to Rank",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.5 Out-of-core Experiment\n\nWe also evaluate our system in the out-of-core setting on the criteo data. We conducted the experiment on one AWS c3.8xlarge machine (32 vcores, two 320 GB SSD, 60 GB RAM). The results are shown in Figure 11. We can find that compression helps to speed up computation by factor of three, and sharding into two disks further gives 2x speedup. For this type of experiment, it is important to use a very large dataset to drain the system file cache for a real outof-core setting. This is indeed our setup. We can observe a transition point when the system runs out of file cache. Note that the transition in the final method is less dramatic. This is due to larger disk throughput and better utilization of computation resources. Our final method is able to process 1.7 billion examples on a single machine.",
        "metadata": {
            "section_header": "Out-of-core Experiment",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.6 Distributed Experiment\n\nFinally, we evaluate the system in the distributed setting. We set up a YARN cluster on EC2 with m3.2xlarge machines, which is a very common choice for clusters. Each machine contains 8 virtual cores, 30GB of RAM and two 80GB SSD local disks. The dataset is stored on AWS S3 instead of HDFS to avoid purchasing persistent storage.\n\nWe first compare our system against two production-level distributed systems: Spark MLLib [18] and H2O 11 . We use\n\n11 www.h2o.ai\n\n(a) End-to-end time cost include data loading\n\n<!-- image -->\n\n(b) Per iteration cost exclude data loading\n\n<!-- image -->\n\nFigure 12: Comparison of different distributed systems on 32 EC2 nodes for 10 iterations on different subset of criteo data. XGBoost runs more 10x than spark per iteration and 2.2x as H2O's optimized version (However, H2O is slow in loading the data, getting worse end-to-end time). Note that spark suffers from drastic slow down when running out of memory. XGBoost runs faster and scales smoothly to the full 1.7 billion examples with given resources by utilizing out-of-core computation.\n\n32 m3.2xlarge machines and test the performance of the systems with various input size. Both of the baseline systems are in-memory analytics frameworks that need to store the data in RAM, while XGBoost can switch to out-of-core setting when it runs out of memory. The results are shown in Fig. 12. We can find that XGBoost runs faster than the baseline systems. More importantly, it is able to take advantage of out-of-core computing and smoothly scale to all 1.7 billion examples with the given limited computing resources. The baseline systems are only able to handle subset of the data with the given resources. This experiment shows the advantage to bring all the system improvement together and solve a real-world scale problem. We also evaluate the scaling property of XGBoost by varying the number of machines. The results are shown in Fig. 13. We can find XGBoost's performance scales linearly as we add more machines. Importantly, XGBoost is able to handle the entire 1.7 billion data with only four machines. This shows the system's potential to handle even larger data.\n\n<!-- image -->\n\nNumber of Machines\n\nFigure 13: Scaling of XGBoost with different number of machines on criteo full 1.7 billion dataset. Using more machines results in more file cache and makes the system run faster, causing the trend to be slightly super linear. XGBoost can process the entire dataset using as little as four machines, and scales smoothly by utilizing more available resources.",
        "metadata": {
            "section_header": "Distributed Experiment",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## 7. CONCLUSION\n\nIn this paper, we described the lessons we learnt when building XGBoost, a scalable tree boosting system that is widely used by data scientists and provides state-of-the-art results on many problems. We proposed a novel sparsity aware algorithm for handling sparse data and a theoretically justified weighted quantile sketch for approximate learning. Our experience shows that cache access patterns, data compression and sharding are essential elements for building a scalable end-to-end system for tree boosting. These lessons can be applied to other machine learning systems as well. By combining these insights, XGBoost is able to solve realworld scale problems using a minimal amount of resources.",
        "metadata": {
            "section_header": "CONCLUSION",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## Acknowledgments\n\nWe would like to thank Tyler B. Johnson, Marco Tulio Ribeiro, Sameer Singh, Arvind Krishnamurthy for their valuable feedback. Wealso sincerely thank Tong He, Bing Xu, Michael Benesty, Yuan Tang, Hongliang Liu, Qiang Kou, Nan Zhu and all other contributors in the XGBoost community. This work was supported in part by ONR (PECASE) N000141010672, NSF IIS 1258741 and the TerraSwarm Research Center sponsored by MARCO and DARPA.",
        "metadata": {
            "section_header": "Acknowledgments",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## APPENDIX",
        "metadata": {
            "section_header": "APPENDIX",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## A. WEIGHTED QUANTILE SKETCH\n\nIn this section, we introduce the weighted quantile sketch algorithm. Approximate answer of quantile queries is for many realworld applications. One classical approach to this problem is GK algorithm [14] and extensions based on the GK framework [24]. The main component of these algorithms is a data structure called quantile summary, that is able to answer quantile queries with relative accuracy of glyph[epsilon1] . Two operations are defined for a quantile summary:\n\n- · A merge operation that combines two summaries with approximation error glyph[epsilon1] 1 and glyph[epsilon1] 2 together and create a merged summary with approximation error max( glyph[epsilon1] 1 , glyph[epsilon1] 2 ).\n- · A prune operation that reduces the number of elements in the summary to b +1 and changes approximation error from glyph[epsilon1] to glyph[epsilon1] + 1 b .\n\nAquantile summary with merge and prune operations forms basic building blocks of the distributed and streaming quantile computing algorithms [24].\n\nIn order to use quantile computation for approximate tree boosting, we need to find quantiles on weighted data. This more general problem is not supported by any of the existing algorithm. In this section, we describe a non-trivial weighted quantile summary structure to solve this problem. Importantly, the new algorithm contains merge and prune operations with the same guarantee as GK summary. This allows our summary to be plugged into all the frameworks used GK summary as building block and answer quantile queries over weighted data efficiently.",
        "metadata": {
            "section_header": "A. WEIGHTED QUANTILE SKETCH",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## A.1 Formalization and Definitions\n\nGiven an input multi-set D = { ( x , w 1 1 ) , ( x , w 2 2 ) · · · ( x n , w n ) } such that w i ∈ [0 , + ∞ ) , x i ∈ X . Each x i corresponds to a position of the point and w i is the weight of the point. Assume we have a total order &lt; defined on X . Let us define two rank functions r -D , r + D : X → [0 , + ∞ )\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nWe should note that since D is defined to be a multiset of the points. It can contain multiple record with exactly same position x and weight w . We also define another weight function ω D : X → [0 , + ∞ ) as\n\n<!-- formula-not-decoded -->\n\nFinally, we also define the weight of multi-set D to be the sum of weights of all the points in the set\n\n<!-- formula-not-decoded -->\n\nOur task is given a series of input D , to estimate r + ( y ) and r -( y ) for y ∈ X as well as finding points with specific rank. Given these notations, we define quantile summary of weighted examples as follows:\n\nDefinition A.1. Quantile Summary of Weighted Data A quantile summary for D is defined to be tuple Q ( D ) = ( S, r ˜ + D , r ˜ -D , ω ˜ D ) , where S = { x , x 1 2 , · · · , x k } is selected from the points in D (i.e. x i ∈ { x | ( x, w ) ∈ D} ) with the following properties:\n\n1) x i &lt; x i +1 for all i , and x 1 and x k are minimum and maximum point in D :\n\n<!-- formula-not-decoded -->\n\n2) ˜ r + D , ˜ r -D and ˜ ω D are functions in S → [0 , + ∞ ) , that satisfies\n\n<!-- formula-not-decoded -->\n\nthe equality sign holds for maximum and minimum point ( ˜ r -D ( x i ) = r -D ( x i ) , ˜ r + D ( x i ) = r + D ( x i ) and ˜ ω D ( x i ) = ω D ( x i ) for i ∈ { 1 , k } ). Finally, the function value must also satisfy the following constraints\n\n<!-- formula-not-decoded -->\n\nSince these functions are only defined on S , it is suffice to use 4 k record to store the summary. Specifically, we need to remember each x i and the corresponding function values of each x i .\n\nDefinition A.2. Extension of Function Domains Given a quantile summary Q ( D ) = ( S, r ˜ + D , r ˜ -D , ω ˜ D ) defined in Definition A.1, the domain of ˜ r + D , ˜ r -D and ˜ ω D were defined only in S . We extend the definition of these functions to X → [0 , + ∞ ) as follows\n\nWhen y &lt; x 1 :\n\n<!-- formula-not-decoded -->\n\nWhen y &gt; x k :\n\n<!-- formula-not-decoded -->\n\nWhen y ∈ ( x , x i i +1 ) for some i :\n\n<!-- formula-not-decoded -->\n\nLemma A.1. Extended Constraint The extended definition of ˜ r -D , ˜ r + D , ˜ ω D satisfies the following constraints\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nProof. The only non-trivial part is to prove the case when y ∈ ( x , x i i +1 ):\n\n<!-- formula-not-decoded -->\n\n˜ r + D ( y ) = ˜ r + D ( x i +1 ) -˜ ω D ( x i +1 ) ≥ r + D ( x i +1 ) -ω D ( x i +1 ) ≥ r + D ( y ) This proves Eq. (19). Furthermore, we can verify that\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nUsing these facts and transitivity of &lt; relation, we can prove Eq. (20)\n\nWe should note that the extension is based on the ground case defined in S , and we do not require extra space to store the summary in order to use the extended definition. We are now ready to introduce the definition of glyph[epsilon1] -approximate quantile summary.\n\nDefinition A.3. glyph[epsilon1] -Approximate Quantile Summary Given a quantile summary Q ( D ) = ( S, r ˜ + D , r ˜ -D , ω ˜ D ) , we call it is glyph[epsilon1] -approximate summary if for any y ∈ X\n\n<!-- formula-not-decoded -->\n\nWe use this definition since we know that r -( y ) ∈ [˜ r -D ( y , r ) ˜ + D ( y ) -˜ ω D ( y )] and r + ( y ) ∈ [˜ r -D ( y ) + ˜ ω D ( y , r ) ˜ + D -( y )] . Eq. (21) means the we can get estimation of r + ( y ) and r ( y ) by error of at most glyph[epsilon1]ω ( D ) .\n\nLemma A.2. Quantile summary Q ( D ) = ( S, r ˜ + D , r ˜ -D , ω ˜ D ) is an glyph[epsilon1] -approximate summary if and only if the following two condition holds\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nProof. The key is again consider y ∈ ( x , x i i +1 )\n\n<!-- formula-not-decoded -->\n\nThis means the condition in Eq. (23) plus Eq. (22) can give us Eq. (21)\n\nProperty of Extended Function In this section, we have introduced the extension of function ˜ r + D , r ˜ -D , ω ˜ D to X → [0 , + ∞ ). The key theme discussed in this section is the relation of constraints on the original function and constraints on the extended function . Lemma A.1 and A.2 show that the constraints on the original function can lead to in more general constraints on the extended function. This is a very useful property which will be used in the proofs in later sections.",
        "metadata": {
            "section_header": "A.1 Formalization and Definitions",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## A.2 Construction of Initial Summary\n\nGiven a small multi-set D = { ( x , w 1 1 ) , ( x , w 2 2 ) , · · · , ( x n , w n ) } , we can construct initial summary Q ( D ) = { S, r ˜ + D , r ˜ -D , ω ˜ D } , with S to the set of all values in D ( S = { x | ( x, w ) ∈ D} ), and ˜ r + D , r ˜ -D , ω ˜ D defined to be\n\n<!-- formula-not-decoded -->\n\nThe constructed summary is 0-approximate summary, since it can answer all the queries accurately. The constructed summary can be feed into future operations described in the latter sections.",
        "metadata": {
            "section_header": "A.2 Construction of Initial Summary",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## A.3 Merge Operation\n\nIn this section, we define how we can merge the two summaries together. Assume we have Q ( D 1 ) = ( S , r 1 ˜ + D 1 , r ˜ -D 1 , ω ˜ D 1 ) and Q ( D 2 ) = ( S , r 2 ˜ + D 1 , r ˜ -D 2 , ω ˜ D 2 ) quantile summary of two dataset D 1 and D 2 . Let D = D ∪ D 1 2 , and define the merged summary Q ( D ) = ( S, r ˜ + D , r ˜ -D , ω ˜ D ) as follows.\n\n<!-- formula-not-decoded -->\n\nThe points in S are combination of points in S 1 and S 2 . And the function ˜ r + D , r ˜ -D , ω ˜ D are defined to be\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nHere we use functions defined on S → [0 , + ∞ ) on the left sides of equalities and use the extended function definitions on the right sides.\n\nDue to additive nature of r + , r -and ω , which can be formally written as\n\n<!-- formula-not-decoded -->\n\nand the extended constraint property in Lemma A.1, we can verify that Q ( D ) satisfies all the constraints in Definition A.1. Therefore it is a valid quantile summary.\n\nLemma A.3. The combined quantile summary satisfies\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nfor all y ∈ X\n\nAlgorithm 4: Query Function g Q, d ( )\n\n```\nInput : d : 0 ≤ d ≤ ω ( D ) Input : Q ( D ) = ( S, r ˜ + D , r ˜ -D , ω ˜ D ) where S = x , x 1 2 , · · · , x k if d < 1 2 [˜ r -D ( x 1 ) + ˜ r + D ( x 1 )] then return x 1 ; if d ≥ 1 2 [˜ r -D ( x k ) + ˜ r + D ( x k )] then return x k ; Find i such that 1 2 [˜ r -D ( x i ) + ˜ r + D ( x i )] ≤ d < 1 2 [˜ r -D ( x i +1 ) + ˜ r + D ( x i +1 )] if 2 d < r ˜ -D ( x i ) + ˜ ω D ( x i ) + ˜ r + D ( x i +1 ) -˜ ω D ( x i +1 ) then return x i else return x i +1 end\n```\n\nThis can be obtained by straight-forward application of Definition A.2.\n\nTheorem A.1. If Q ( D 1 ) is glyph[epsilon1] 1 -approximate summary, and Q ( D 2 ) is glyph[epsilon1] 2 -approximate summary. Then the merged summary Q ( D ) is max( glyph[epsilon1] 1 , glyph[epsilon1] 2 ) -approximate summary.\n\nProof. For any y ∈ X , we have\n\n<!-- formula-not-decoded -->\n\nHere the first inequality is due to Lemma A.3.",
        "metadata": {
            "section_header": "A.3 Merge Operation",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    },
    {
        "page_content": "## A.4 Prune Operation\n\nBefore we start discussing the prune operation, we first introduce a query function g Q, d ( ). The definition of function is shown in Algorithm 4. For a given rank d , the function returns a x whose rank is close to d . This property is formally described in the following Lemma.\n\nLemma A.4. For a given glyph[epsilon1] -approximate summary Q ( D ) = ( S, r ˜ + D , r ˜ -D , ω ˜ D ) , x ∗ = g Q, d ( ) satisfies the following property\n\n<!-- formula-not-decoded -->\n\nProof. We need to discuss four possible cases\n\n- · d &lt; 1 2 [˜ r -D ( x 1 ) + ˜ r + D ( x 1 )] and x ∗ = x 1 . Note that the rank information for x 1 is accurate (˜ ω D ( x 1 ) = ˜ r + D ( x 1 ) = ω x ( 1 ), ˜ r -D ( x 1 ) = 0), we have\n\n<!-- formula-not-decoded -->\n\n- · d ≥ 1 2 [˜ r -D ( x k ) + ˜ r + D ( x k )] and x ∗ = x k , then\n\n<!-- formula-not-decoded -->\n\n- · x ∗ = x i in the general case, then\n- · x ∗ = x i +1 in the general case\n\n```\n2 d < r ˜ -D ( x i ) + ˜ ω D ( x i ) + ˜ r + D ( x i +1 ) -˜ ω D ( x i +1 ) = 2[˜ r -D ( x i ) + ˜ ω D ( x i )] + [˜ r + D ( x i +1 ) -˜ ω D ( x i +1 ) -˜ r -D ( x i ) -˜ ω D ( x i )] ≤ 2[˜ r -D ( x i ) + ˜ ω D ( x i )] + glyph[epsilon1]ω ( D ) 2 d ≥ ˜ r -D ( x i ) + ˜ r + D ( x i ) = 2[˜ r + D ( x i ) -˜ ω D ( x i )] -[˜ r + D ( x i ) -˜ ω D ( x i ) -˜ r -D ( x i )] + ˜ ω D ( x i ) ≥ 2[˜ r + D ( x i ) -˜ ω D ( x i )] -glyph[epsilon1]ω ( D ) + 0\n```\n\n2\n\nd\n\n≥\n\n˜\n\nr\n\n-\n\n+\n\nD\n\n(\n\nx\n\ni\n\n) + ˜\n\nω\n\nD\n\n(\n\nx\n\ni\n\n) + ˜\n\nr\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n)\n\n-\n\n˜\n\nω\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n)\n\n- = 2[˜ r + D ( x i +1 ) -˜ ω D ( x i +1 )]\n- -[˜ r + D ( x i +1 ) -˜ ω D ( x i +1 ) -˜ r -D ( x i ) -˜ ω D ( x i )]\n\n≥\n\n2[˜\n\nr\n\n+\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n) + ˜\n\nω\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n)]\n\n-\n\nglyph[epsilon1]ω\n\n(\n\nD\n\n)\n\n≤\n\n˜\n\nr\n\n-\n\n+\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n) + ˜\n\nr\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n)\n\n- = 2[˜ r -D ( x i +1 ) + ˜ ω D ( x i +1 )]\n\n+[˜\n\nr\n\n+\n\n-\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n)\n\n-\n\n˜\n\nω\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n)\n\n-\n\n˜\n\nr\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n)]\n\n-\n\n˜\n\nω\n\nD\n\n(\n\nx\n\ni\n\n+1\n\n)\n\n- ≤ 2[˜ r -D ( x i +1 ) + ˜ ω D ( x i +1 )] + glyph[epsilon1]ω ( D -) 0\n\nNow we are ready to introduce the prune operation. Given a quantile summary Q ( D ) = ( S, r ˜ + D , r ˜ -D , ω ˜ D ) with S = { x , x 1 2 , · · · , x k } elements, and a memory budget b . The prune operation creates another summary Q ′ ( D ) = ( S , r ′ ˜ + D , r ˜ -D , ω ˜ D ) with S ′ = { x , x ′ 1 ′ 2 , · · · , x ′ b +1 } , where x ′ i are selected by query the original summary such that\n\n<!-- formula-not-decoded -->\n\nThe definition of ˜ r + D , r ˜ -D , ω ˜ D in Q ′ is copied from original summary Q , by restricting input domain from S to S ′ . There could be duplicated entries in the S ′ . These duplicated entries can be safely removed to further reduce the memory cost. Since all the elements in Q ′ comes from Q , we can verify that Q ′ satisfies all the constraints in Definition A.1 and is a valid quantile summary.\n\nTheorem A.2. Let Q ′ ( D ) be the summary pruned from an glyph[epsilon1] -approximate quantile summary Q ( D ) with b memory budget. Then Q ′ ( D ) is a ( glyph[epsilon1] + 1 b ) -approximate summary.\n\nProof. We only need to prove the property in Eq. (23) for Q ′ . Using Lemma A.4, we have\n\n<!-- formula-not-decoded -->\n\nCombining these inequalities gives\n\n<!-- formula-not-decoded -->\n\n2\n\nd",
        "metadata": {
            "section_header": "A.4 Prune Operation",
            "title": "XGBoost: A Scalable Tree Boosting System",
            "type": "paper"
        }
    }
]