[
    {
        "page_content": "## Abstract\n\nA probabilistic model is introduced for the problem of stimulating a large male audience. Double jerking is considered, in which two shafts may be stimulated with a single hand. Both tip-to-tip and shaft-to-shaft configurations of audience members are analyzed. We demonstrate that pre-sorting members of the audience according to both shaft girth and leg length allows for more efficient stimulation. Simulations establish steady rates of stimulation even as the variance of certain parameters is allowed to grow, whereas naive unsorted schemes have increasingly flaccid performance.\n\nAssume a large presentation hall with at least one aisle. A presenter is given a set amount of time with which to 'stimulate' as many audience members as possible as he makes his way down the aisle. How much stimulation is possible?\n\nIn Sec. 1, we introduce a probabilistic model for audience stimulation. Sec. 2 refines this model by specifying distributional assumptions on audience members' receptiveness to stimulation. The member-sorting approach that we suggest is described in Sec. 3, and its performance is numerically examined in Sec. 4.",
        "metadata": {
            "section_header": "Abstract",
            "title": "Optimal Tip-to-Tip Efficiency a model for male audience stimulation",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1 Model of Persuasion",
        "metadata": {
            "section_header": "Model of Persuasion",
            "title": "Optimal Tip-to-Tip Efficiency a model for male audience stimulation",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1.1 Single Member Stimulation\n\nConsider first the stimulation of the i th audience member in isolation. We restrict the presenter to using a single hand, and the member's shaft is assumed to be perfectly cylindrical and of some girth D . All shafts are assumed to be rigid at the time at which stimulation begins. Suppose the presenter's hand makes contact with a fraction f s ∈ [0 , 1] of the shaft's circumference. This scenario is depicted in cross-section in Fig. 1.\n\nThe audience member receives some amount of gratification from each jerk action. Before presenting our model for this gratification, it is helpful to state and justify some of the assumptions.\n\nFigure 1: A hand makes contact with fraction f s of the shaft's girth D .\n\n<!-- image -->\n\n- M1 The gratification resulting from each jerk depends only on the physical and geometric parameters of the problem (shaft girth, hand size). For instance, a 20 year old man who hasn't been stimulated in a week's time receives the same gratification from a jerk action as would a freshly stimulated 80 year-old-man, provided the geometric parameters are identical.\n- M2 Non-geometric variation between individuals (for instance the age difference, or time-since-last-persuasion in the preceding example) are captured separately via a gratification threshold Λ that varies from individual to individual. This is helpful for separating the modeling of individual biases and the geometric aspects of the problem.\n- M3 Presenters who jerk faster will clearly perform better, but we seek results that are invariant to a presenter's jerking speed. As such, instead of measuring the time taken, we measure the number of jerks that are performed.\n- M4 Gratification per jerk ranges from 0 to 1, and is determined entirely by the fraction f s of a member's shaft that is in contact with the presenter's hand, and the fraction of time f t during a jerk action that this contact is maintained. There is an equanimity to this assumption, as it implies that individuals receive the same physical gratification per jerk regardless of shaft girth.\n\nEvery jerk action performed by the presenter transfers a quantity of gratification S f ( s ) T f ( t ) ∈ [0 , 1] to the audience member, where S f ( ) is the spatial gratification function and T f ( ) the temporal gratification function. Thus, after J jerks the member will have received a cumulative gratification of JS f ( s ) T f ( s ). Once this cumulative gratification exceeds the member's gratification threshold Λ ∈ R + , a climactic and identifiable stimulation event will occur, and the presenter will be free to move to another member of the audience.\n\nThe choice of gratification functions S f , T ( ) ( f ) : [0 , 1] → [0 , 1] has great impact on our analysis. We motivate potential choices with several axioms:\n\n- A1. Zero gratification occurs in the absence of hand-on-shaft contact: S (0) = 0 and T (0) = 0.\n\nFigure 2: Tip-to-tip alignment above, shaft-to-shaft alignment below.\n\n<!-- image -->\n\n- A2. Gratification should increase monotonically with hand-on-shaft contact, with maximal gratification occurring at full spatial contact S (1) = 1 and/or full temporal contact T (1) = 1.\n- A3. One expects diminishing benefits from additional hand-on-shaft contact. Therefore S f ( s ) and T f ( t ) should be concave ∩ .\n\nWhile the particular choice of S f ( s ) and T f ( t ) does influence numerical results, our analysis is largely preserved for any choice of these functions that satisfy the above three axioms. For our simulated results (Sec. 4), the gratification function √ f is used for both.\n\nAs the presenter almost certainly has two hands, it is not unreasonable to suggest the stimulation of two audience members at once: one with each hand. The problem becomes considerably more interesting, however, once we admit the possibility of simultaneously stimulating multiple audience members per hand .",
        "metadata": {
            "section_header": "Single Member Stimulation",
            "title": "Optimal Tip-to-Tip Efficiency a model for male audience stimulation",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1.2 Multiple Stimulation\n\nIt is physically unreasonable to allow jerk actions on three or more shafts with a single hand - it is unclear how audience members could be arranged to perform such a feat. However, there is considerable photographic evidence to suggest that two shafts per hand is not only feasible, but efficient. We refer to this as a double jerk . There are primarily two ways in which a double jerk may be performed (Fig. 2).\n\n- 1. Tip-to-tip (series jerking): two individuals stand facing one another, with their members touching tip-to-tip. A single hand moves across both shafts, treating them as one extra-long shaft.\n- 2. Shaft-to-shaft (parallel jerking): Two individuals stand facing one another, with their members against one another lengthwise. A single hand wraps around both shafts, treating them as one extra-thick shaft.\n\nWe assume in the double jerk scenario that jerking must continue until both members have exceeded their gratification threshold.\n\nFigure 3: Two leg-length mismatched audience members jerked tip-to-tip.\n\n<!-- image -->\n\nFigure 4: Two leg-length mismatched audience members jerked shaft-to-shaft.\n\n<!-- image -->\n\nThe first challenge associated with double jerking, either tip-to-tip or shaftto-shaft involves shaft alignment when audience members are of different leg lengths. There are three approaches to this problem:\n\n- 1. Ask the taller member to squat, in which case his gratification will be reduced from physical discomfort.\n- 2. Ask the shorter member to stand on a box. The humiliation will likely reduce his gratification as well.\n- 3. Attempt to double jerk vertically displaced shafts by angling the taller individual's shaft down and the shorter individual's shaft up. The jerk direction will no longer be perpendicular to the individuals in this case (Figs. 3 and 4), so gratification will again be reduced.\n\nWe assume the third option, as it permits a simple geometric penalty to gratification by projecting the jerk vector perpendicular to the individuals. In the tip-to-tip configuration (Fig. 3), this penalized gratification-per-jerk for either of the shafts is given by\n\n<!-- formula-not-decoded -->\n\nand in the shaft-to-shaft configuration (Fig. 4),\n\n<!-- formula-not-decoded -->\n\nObserve that a greater penalty for mismatch is paid in the shaft-to-shaft scenario, and that in both situations no jerking is possible when the shafts cannot bridge the height difference between the individuals. In general, it is strongly in the presenter's interest to sort audience members by leg-length before performing double-jerks so as to avoid these penalties.\n\nThe second source of geometric variation between the two individuals is from shaft girth and shaft length. These variations impact the two scenarios we consider in different ways.",
        "metadata": {
            "section_header": "Multiple Stimulation",
            "title": "Optimal Tip-to-Tip Efficiency a model for male audience stimulation",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1.2.1 Shaft Girth\n\nSuppose the two audience members being double-jerked are of widely disparate shaft girths. In the tip-to-tip setting, it is assumed that the presenter is able to modulate the tightness of his hand over the course of a jerk. We invite the reader to simulate this action himself, and we argue that it is not particularly difficult. As such, for a sufficiently large hand, full contact will occur for both shafts, i.e. f s = 1.\n\nThe analysis is considerably more complex in the shaft-to-shaft setting. Approximating the shafts' cross sections as perfectly circular, let r and R be the radii of the smaller and larger shaft, respectively, and let f and F denote the\n\nFigure 5: Cross section of two different-girth shafts being jerked. The hand is assumed to be taut around the shafts.\n\n<!-- image -->\n\nof each shaft circumference that is contacted by the presenter's hand. We make the following geometric assumptions:\n\n- 1. In cross-section, the hand can be modeled as a rubber band around two shafts that are perfectly circular. In reality, the hand will not be quite so taut, the shafts will not be circular, and there will be shaft contact even in the gap region, but we argue that the assumption is valid to first order.\n- 2. We assume the hand is sufficiently large to wrap around both shafts. This too is not an completely valid assumption, but it is accurate to first order.\n- 3. We assume that if the hand is sufficiently large to wrap around more than both shafts, this has no additional benefit to gratification for either individual.\n\nIt may be observed that fractional coverage of the larger and smaller shafts are given by the angles θ and θ = 2 π -θ in Fig. 5 according to\n\n<!-- formula-not-decoded -->\n\nand\n\n<!-- formula-not-decoded -->\n\nNote that this relation suggests at first glance that there is no benefit to double jerking, as one will always be jerking a fractional total of one shaft per jerk. However, the concavity of the utility function S f ( s ) T f ( t ) (from modeling axiom A3's 'diminishing returns') tells us that jerking two shafts with half fractional contact f = 1 2 is more gratifying 2 / S (1 / 2) T (1) than jerking one shaft with the hand wrapped completely around it S (1) T (1).\n\nGeometric analysis reveals that the angle θ in Fig. 5 is given by\n\n<!-- formula-not-decoded -->\n\nAs such, the fractional coverages are given by\n\n<!-- formula-not-decoded -->\n\nand\n\n<!-- formula-not-decoded -->",
        "metadata": {
            "section_header": "Shaft Girth",
            "title": "Optimal Tip-to-Tip Efficiency a model for male audience stimulation",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1.2.2 Shaft Length\n\nAs with girth, the analysis for variation in shaft length differs between the two scenarios we consider. Let L be the length of the longer shaft and glyph[lscript] be the length of the shorter shaft.\n\nIn the shaft-to-shaft setting, we assume that the presenter's hand will always be in contact with both shafts. This is true provided that the difference in shaft lengths does not exceed the width of the presenter's hand. Under this assumption, the cross-sectional geometry of Fig. 5 remains fixed throughout the jerk action and the temporal fraction for both individuals is f t = 1.\n\nIn the tip-to-tip setting, however, the presenter is only making contact with one of the members at any moment. Clearly, more time will be spent grasping the longer shaft: call its fraction of the total jerk F , and the shorter shaft's fraction f . Since the total amount of time during a jerk is split between the shafts, F + f = 1.\n\nThe tip-to-tip dependence of F and f on L and glyph[lscript] is complicated, and depends heavily on the presenter's jerking technique. For a presenter who jerks at a constant velocity with near-instantaneous change in direction at the base of each shaft, F and f will be proportioned according to L L + glyph[lscript] and glyph[lscript] L + glyph[lscript] , and more time will be spent on the longer shaft. For a presenter with a bursty jerk motion that slows at the base of each shaft, the fractional breakdown will be even regardless of relative shaft lengths. We assume the former, as it appears to be closer to optimal jerking technique when the goal is rapid gratification.",
        "metadata": {
            "section_header": "Shaft Length",
            "title": "Optimal Tip-to-Tip Efficiency a model for male audience stimulation",
            "type": "paper"
        }
    },
    {
        "page_content": "## 2 Gratification Threshold\n\nThe gratification threshold Λ for any individual is a random variable determined by various features of an individual. The larger Λ is, the more jerks will be necessary to exceed it and trigger the climactic stimulation event.\n\nAge. We assume that Λ is proportional to an age-dependency function g ( ) · : R + → R + . In a more formal study, g would perhaps be based on hard data about various age demographics. As a first order approximation, we\n\nFigure 6: Age dependency function g ( ). · Age is in years.\n\n<!-- image -->\n\nuse the heuristic age dependency function depicted in Fig. 6. Observe that this function diverges before puberty, reaches a global minimum at age 12, reaches a local minimum at age 45, and then once again increases monotonically.\n\nTime since last gratification. We assume inverse proportionality plus a constant to the time since the individual's last gratification: Λ ∝ 1 √ T 0 + C . We expect the gratification threshold to reach a nonzero minimum after a sufficient wait time, and this is reflected in the above relation, plotted in Fig. 7.\n\nReceptiveness to the presenter. More difficult to quantify is the individual's general receptiveness to the presenter and to the act of stimulation. This is captured by adding a noise term Z with normal distribution to Λ.\n\nTo summarize, we assume\n\n<!-- formula-not-decoded -->\n\nwhere Z has a normal distribution of standard deviation σ (a parameter of the model) and zero mean. Note that if Λ ≤ 0, we assume the audience member is instantly gratified past his threshold.\n\nIn our setting, none of these parameters are visible to the presenter. From his or her perspective, there exists a distribution over age and a distribution over time since last stimulation. The gratification threshold Λ for each individual is then distributed independently and identically.\n\nFigure 7: Dependency on time (in hours) since the member's last stimulation.\n\n<!-- image -->",
        "metadata": {
            "section_header": "Gratification Threshold",
            "title": "Optimal Tip-to-Tip Efficiency a model for male audience stimulation",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3 Description of MP scheme\n\nGiven the penalty paid for non-horizontal shafts, it is clearly in our presenter's interest to group individuals according to leg-length. This minimizes the vertical gap between shafts and ensures that each jerk operates at maximum efficiency. As such, our suggested schemes both begin by sorting audience members by leg-length. However, further gains are possible from sorting by either length or girth.\n\nConsider two individuals of approximately equal leg-length, with gratification thresholds Λ 1 and Λ , and spatial gratifications-per-jerk 2 S f ( 1 ) and S f ( 2 ), respectively. In a shaft-to-shaft setting, the number of jerks required for the presenter to single-handedly (literally) achieve stimulation of both individuals is given by the maximum of their individual stimulation times:\n\n<!-- formula-not-decoded -->\n\nwhere we recall that f t = 1 and therefore T f ( t ) = 1. We may equivalently look at the inverse of this, which we call the stimulation rate\n\n<!-- formula-not-decoded -->\n\nSubstituting in the requirement that f 1 + f 2 = 1 from (2), we have\n\n<!-- formula-not-decoded -->\n\nOur goal is to maximize the expectation of this quantity (equivalent to minimizing time-to-doublejerk). The following theorem tells us that this maximum is always achieved by matching shaft girths.\n\nTheorem 1. For any S f ( s ) that is both monotonically increasing and concave, the expected shaft-to-shaft stimulation rate E R [ S ] satisfies the bound\n\n<!-- formula-not-decoded -->\n\nwith equality achieved when f 1 = f 2 .\n\nProof. Suppose f 1 + f 2 = 1. We may write the expected stimulation rate as\n\n<!-- formula-not-decoded -->\n\nBecause Λ 1 and Λ 2 are identically distributed, we have that\n\n<!-- formula-not-decoded -->\n\nTherefore, by linearity of expectation,\n\n<!-- formula-not-decoded -->\n\nWe may expand this into the minimum of the four possible combinations of terms from the two minima:\n\n<!-- formula-not-decoded -->\n\nObserve that since f 1 + f 2 = 1, and since S ( ) · is monotonically increasing, either S f ( 1 ) or S f ( 2 ) will be upper bounded by S (1 / 2). Therefore, we may upper bound the minimum of the first two terms:\n\n<!-- formula-not-decoded -->\n\nFurthermore, by concavity of S ( ) we have that · S f ( 1 )+ S f ( 2 ) ≤ 2 S ( 1 2 ( f 1 + f 2 ) ) = 2 S ( 1 2 ) . This allows us to upper bound the last two terms in the minimization:\n\n<!-- formula-not-decoded -->\n\nWe may omit the first term, as it is the average of the latter two:\n\n<!-- formula-not-decoded -->\n\nSince each of the inequalities is satisfied with equality when f 1 = f 2 = 1 2, this / proves the theorem.\n\nA completely analogous analysis holds for the tip-to-tip scenario, but in the context of the temporal gratification function T f ( t ):\n\nTheorem 2. For any T f ( t ) that is both monotonically increasing and concave, the expected tip-to-tip stimulation rate is maximized when f 1 = f 2 , and takes the value\n\n<!-- formula-not-decoded -->\n\nwith equality achieved when f 1 = f 2 .\n\nOur suggested tip-to-tip scheme therefore involves the following steps:\n\n- 1. Sort the audience into bins corresponding to each leg length, at the resolution of a centimeter.\n- 2. Sort the members in each bin based on shaft length.\n- 3. Double jerk adjacent individuals from the same bin with each hand, tipto-tip.\n\nThe shaft-to-shaft scheme is very similar:\n\n- 1. Sort the audience into bins corresponding to each leg length, at the resolution of a centimeter.\n- 2. Sort the members in each bin based on shaft girth or diameter.\n- 3. Double jerk adjacent individuals from the same bin with each hand, shaftto-shaft.",
        "metadata": {
            "section_header": "Description of MP scheme",
            "title": "Optimal Tip-to-Tip Efficiency a model for male audience stimulation",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4 Numerical Results\n\nSimulation results are summarized in Fig. 8. We compare performance of three presenters employing tip-to-tip double jerking.\n\nPresenter A performs tip-to-tip jerking after sorting the audience members by leg-length and shaft-length.\n\nPresenter B performs tip-to-tip jerking after sorting the audience members by leg-length.\n\nPresenter C performs tip-to-tip jerking without sorting.\n\nGirth, shaft-length, and leg-length are each assumed to be distributed according to independent truncated normal distributions centered respectively on a 2 inch shaft diameter, 5.5 inch shaft length, and 31 inch leg-length. Stimulation rate, normalized by the expected stimulation rate from single-jerking, is plotted vertically against increasing variance in each of these distributions. One may observe that while presenter A remains strong even in the presence of member variation, presenters B and C demonstrate increasingly flaccid performance.\n\nFigure 8: Tip-to-tip performance, normalized by expected single-jerking performance. Presenter A (red) sorts by shaft-length and leg-length, Presenter B (green) sorts by leg-length, and Presenter C (blue) does not sort. The variance of all three sources of uncertainty increases along the horizontal.\n\n<!-- image -->",
        "metadata": {
            "section_header": "Numerical Results",
            "title": "Optimal Tip-to-Tip Efficiency a model for male audience stimulation",
            "type": "paper"
        }
    }
]