[
    {
        "page_content": "## Berkeley AI Research (BAIR) Laboratory, UC Berkeley\n\n{ isola,junyanz,tinghuiz,efros @eecs.berkeley.edu }\n\nFigure 1: Many problems in image processing, graphics, and vision involve translating an input image into a corresponding output image. These problems are often treated with application-specific algorithms, even though the setting is always the same: map pixels to pixels. Conditional adversarial nets are a general-purpose solution that appears to work well on a wide variety of these problems. Here we show results of the method on several. In each case we use the same architecture and objective, and simply train on different data.\n\n<!-- image -->",
        "metadata": {
            "section_header": "Berkeley AI Research (BAIR) Laboratory, UC Berkeley",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## Abstract\n\nWe investigate conditional adversarial networks as a general-purpose solution to image-to-image translation problems. These networks not only learn the mapping from input image to output image, but also learn a loss function to train this mapping. This makes it possible to apply the same generic approach to problems that traditionally would require very different loss formulations. We demonstrate that this approach is effective at synthesizing photos from label maps, reconstructing objects from edge maps, and colorizing images, among other tasks. Indeed, since the release of the pix2pix software associated with this paper, a large number of internet users (many of them artists) have posted their own experiments with our system, further demonstrating its wide applicability and ease of adoption without the need for parameter tweaking. As a community, we no longer hand-engineer our mapping functions, and this work suggests we can achieve reasonable results without hand-engineering our loss functions either.",
        "metadata": {
            "section_header": "Abstract",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1. Introduction\n\nMany problems in image processing, computer graphics, and computer vision can be posed as 'translating' an input image into a corresponding output image. Just as a concept may be expressed in either English or French, a scene may be rendered as an RGB image, a gradient field, an edge map, a semantic label map, etc. In analogy to automatic language translation, we define automatic image-to-image translation as the task of translating one possible representation of a scene into another, given sufficient training data (see Figure 1). Traditionally, each of these tasks has been tackled with separate, special-purpose machinery (e.g., [16, 25, 20, 9, 11, 53, 33, 39, 18, 58, 62]), despite the fact that the setting is always the same: predict pixels from pixels. Our goal in this paper is to develop a common framework for all these problems.\n\nThe community has already taken significant steps in this direction, with convolutional neural nets (CNNs) becoming the common workhorse behind a wide variety of image prediction problems. CNNs learn to minimize a loss function an objective that scores the quality of results - and although the learning process is automatic, a lot of manual effort still\n\ngoes into designing effective losses. In other words, we still have to tell the CNN what we wish it to minimize. But, just like King Midas, we must be careful what we wish for! If we take a naive approach and ask the CNN to minimize the Euclidean distance between predicted and ground truth pixels, it will tend to produce blurry results [43, 62]. This is because Euclidean distance is minimized by averaging all plausible outputs, which causes blurring. Coming up with loss functions that force the CNN to do what we really want - e.g., output sharp, realistic images - is an open problem and generally requires expert knowledge.\n\nIt would be highly desirable if we could instead specify only a high-level goal, like 'make the output indistinguishable from reality', and then automatically learn a loss function appropriate for satisfying this goal. Fortunately, this is exactly what is done by the recently proposed Generative Adversarial Networks (GANs) [24, 13, 44, 52, 63]. GANs learn a loss that tries to classify if the output image is real or fake, while simultaneously training a generative model to minimize this loss. Blurry images will not be tolerated since they look obviously fake. Because GANs learn a loss that adapts to the data, they can be applied to a multitude of tasks that traditionally would require very different kinds of loss functions.\n\nIn this paper, we explore GANs in the conditional setting. Just as GANs learn a generative model of data, conditional GANs (cGANs) learn a conditional generative model [24]. This makes cGANs suitable for image-to-image translation tasks, where we condition on an input image and generate a corresponding output image.\n\nGANs have been vigorously studied in the last two years and many of the techniques we explore in this paper have been previously proposed. Nonetheless, earlier papers have focused on specific applications, and it has remained unclear how effective image-conditional GANs can be as a general-purpose solution for image-toimage translation. Our primary contribution is to demonstrate that on a wide variety of problems, conditional GANs produce reasonable results. Our second contribution is to present a simple framework sufficient to achieve good results, and to analyze the effects of several important architectural choices. Code is available at https://github.com/phillipi/pix2pix .",
        "metadata": {
            "section_header": "Introduction",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3. Method\n\nGANs are generative models that learn a mapping from random noise vector z to output image y , G : z → y [24]. In\n\ncontrast, conditional GANs learn a mapping from observed image x and random noise vector z , to y , G : { x, z } → y . The generator G is trained to produce outputs that cannot be distinguished from 'real' images by an adversarially trained discriminator, D , which is trained to do as well as possible at detecting the generator's 'fakes'. This training procedure is diagrammed in Figure 2.",
        "metadata": {
            "section_header": "Method",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.1. Objective\n\nThe objective of a conditional GAN can be expressed as\n\n<!-- formula-not-decoded -->\n\nwhere G tries to minimize this objective against an adversarial D that tries to maximize it, i.e. G ∗ = arg min G max D L cGAN ( G,D ) .\n\nTo test the importance of conditioning the discriminator, we also compare to an unconditional variant in which the discriminator does not observe x :\n\n<!-- formula-not-decoded -->\n\nPrevious approaches have found it beneficial to mix the GAN objective with a more traditional loss, such as L2 distance [43]. The discriminator's job remains unchanged, but the generator is tasked to not only fool the discriminator but also to be near the ground truth output in an L2 sense. We also explore this option, using L1 distance rather than L2 as L1 encourages less blurring:\n\n<!-- formula-not-decoded -->\n\nOur final objective is\n\n<!-- formula-not-decoded -->\n\nWithout z , the net could still learn a mapping from x to y , but would produce deterministic outputs, and therefore fail to match any distribution other than a delta function. Past conditional GANs have acknowledged this and provided Gaussian noise z as an input to the generator, in addition to x (e.g., [55]). In initial experiments, we did not find this strategy effective - the generator simply learned to ignore the noise - which is consistent with Mathieu et al. [40]. Instead, for our final models, we provide noise only in the form of dropout, applied on several layers of our generator at both training and test time. Despite the dropout noise, we observe only minor stochasticity in the output of our nets. Designing conditional GANs that produce highly stochastic output, and thereby capture the full entropy of the conditional distributions they model, is an important question left open by the present work.\n\nFigure 3: Two choices for the architecture of the generator. The 'U-Net' [50] is an encoder-decoder with skip connections between mirrored layers in the encoder and decoder stacks.\n\n<!-- image -->",
        "metadata": {
            "section_header": "Objective",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.2. Network architectures\n\nWe adapt our generator and discriminator architectures from those in [44]. Both generator and discriminator use modules of the form convolution-BatchNorm-ReLu [29]. Details of the architecture are provided in the supplemental materials online, with key features discussed below.",
        "metadata": {
            "section_header": "Network architectures",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.2.1 Generator with skips\n\nA defining feature of image-to-image translation problems is that they map a high resolution input grid to a high resolution output grid. In addition, for the problems we consider, the input and output differ in surface appearance, but both are renderings of the same underlying structure. Therefore, structure in the input is roughly aligned with structure in the output. We design the generator architecture around these considerations.\n\nMany previous solutions [43, 55, 30, 64, 59] to problems in this area have used an encoder-decoder network [26]. In such a network, the input is passed through a series of layers that progressively downsample, until a bottleneck layer, at which point the process is reversed. Such a network requires that all information flow pass through all the layers, including the bottleneck. For many image translation problems, there is a great deal of low-level information shared between the input and output, and it would be desirable to shuttle this information directly across the net. For example, in the case of image colorization, the input and output share the location of prominent edges.\n\nTo give the generator a means to circumvent the bottleneck for information like this, we add skip connections, following the general shape of a 'U-Net' [50]. Specifically, we add skip connections between each layer i and layer n -i , where n is the total number of layers. Each skip connection simply concatenates all channels at layer i with those at layer n -i .",
        "metadata": {
            "section_header": "Generator with skips",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.2.2 Markovian discriminator (PatchGAN)\n\nIt is well known that the L2 loss -and L1, see Figure 4 - produces blurry results on image generation problems [34]. Although these losses fail to encourage high-\n\nfrequency crispness, in many cases they nonetheless accurately capture the low frequencies. For problems where this is the case, we do not need an entirely new framework to enforce correctness at the low frequencies. L1 will already do.\n\nThis motivates restricting the GAN discriminator to only model high-frequency structure, relying on an L1 term to force low-frequency correctness (Eqn. 4). In order to model high-frequencies, it is sufficient to restrict our attention to the structure in local image patches. Therefore, we design a discriminator architecture - which we term a Patch GAN - that only penalizes structure at the scale of patches. This discriminator tries to classify if each N × N patch in an image is real or fake. We run this discriminator convolutionally across the image, averaging all responses to provide the ultimate output of D .\n\nIn Section 4.4, we demonstrate that N can be much smaller than the full size of the image and still produce high quality results. This is advantageous because a smaller PatchGAN has fewer parameters, runs faster, and can be applied to arbitrarily large images.\n\nSuch a discriminator effectively models the image as a Markov random field, assuming independence between pixels separated by more than a patch diameter. This connection was previously explored in [38], and is also the common assumption in models of texture [17, 21] and style [16, 25, 22, 37]. Therefore, our PatchGAN can be understood as a form of texture/style loss.",
        "metadata": {
            "section_header": "Markovian discriminator (PatchGAN)",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.3. Optimization and inference\n\nTo optimize our networks, we follow the standard approach from [24]: we alternate between one gradient descent step on D , then one step on G . As suggested in the original GAN paper, rather than training G to minimize log(1 -D x,G x,z ( ( )) , we instead train to maximize log D x,G x,z ( ( )) [24]. In addition, we divide the objective by 2 while optimizing D , which slows down the rate at which D learns relative to G . We use minibatch SGD and apply the Adam solver [32], with a learning rate of 0 0002 . , and momentum parameters β 1 = 0 5 . , β 2 = 0 999 . .\n\nAt inference time, we run the generator net in exactly the same manner as during the training phase. This differs from the usual protocol in that we apply dropout at test time, and we apply batch normalization [29] using the statistics of the test batch, rather than aggregated statistics of the training batch. This approach to batch normalization, when the batch size is set to 1, has been termed 'instance normalization' and has been demonstrated to be effective at image generation tasks [54]. In our experiments, we use batch sizes between 1 and 10 depending on the experiment.",
        "metadata": {
            "section_header": "Optimization and inference",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4. Experiments\n\nTo explore the generality of conditional GANs, we test the method on a variety of tasks and datasets, including both graphics tasks, like photo generation, and vision tasks, like semantic segmentation:\n\n- · Semantic labels ↔ photo , trained on the Cityscapes dataset [12].\n- · Architectural labels → photo , trained on CMP Facades [45].\n- · Map ↔ aerial photo , trained on data scraped from Google Maps.\n- · BW → color photos , trained on [51].\n- · Edges → photo , trained on data from [65] and [60]; binary edges generated using the HED edge detector [58] plus postprocessing.\n- · Sketch → photo : tests edges → photo models on humandrawn sketches from [19].\n- · Day → night , trained on [33].\n- · Photo with missing pixels → inpainted photo , trained on Paris StreetView from [14].\n- · Thermal → color photos , trained on data from [27].\n\nDetails of training on each of these datasets are provided in the supplemental materials online. In all cases, the input and output are simply 1-3 channel images. Qualitative results are shown in Figures 8, 9, 11, 10, 13, 14, 15, 16, 17, 18, 19, 20. Several failure cases are highlighted in Figure 21. More comprehensive results are available at https://phillipi.github.io/pix2pix/ .\n\nData requirements and speed We note that decent results can often be obtained even on small datasets. Our facade training set consists of just 400 images (see results in Figure 14), and the day to night training set consists of only 91 unique webcams (see results in Figure 15). On datasets of this size, training can be very fast: for example, the results shown in Figure 14 took less than two hours of training on a single Pascal Titan X GPU. At test time, all models run in well under a second on this GPU.",
        "metadata": {
            "section_header": "Experiments",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.1. Evaluation metrics\n\nEvaluating the quality of synthesized images is an open and difficult problem [52]. Traditional metrics such as perpixel mean-squared error do not assess joint statistics of the result, and therefore do not measure the very structure that structured losses aim to capture.\n\nTo more holistically evaluate the visual quality of our results, we employ two tactics. First, we run 'real vs. fake' perceptual studies on Amazon Mechanical Turk (AMT). For graphics problems like colorization and photo generation, plausibility to a human observer is often the ultimate goal. Therefore, we test our map generation, aerial photo generation, and image colorization using this approach.\n\nFigure 4: Different losses induce different quality of results. Each column shows results trained under a different loss. Please see https://phillipi.github.io/pix2pix/ for additional examples.\n\n<!-- image -->\n\nSecond, we measure whether or not our synthesized cityscapes are realistic enough that off-the-shelf recognition system can recognize the objects in them. This metric is similar to the 'inception score' from [52], the object detection evaluation in [55], and the 'semantic interpretability' measures in [62] and [42].\n\nAMTperceptual studies For our AMT experiments, we followed the protocol from [62]: Turkers were presented with a series of trials that pitted a 'real' image against a 'fake' image generated by our algorithm. On each trial, each image appeared for 1 second, after which the images disappeared and Turkers were given unlimited time to respond as to which was fake. The first 10 images of each session were practice and Turkers were given feedback. No feedback was provided on the 40 trials of the main experiment. Each session tested just one algorithm at a time, and Turkers were not allowed to complete more than one session. ∼ 50 Turkers evaluated each algorithm. Unlike [62], we did not include vigilance trials. For our colorization experiments, the real and fake images were generated from the same grayscale input. For map ↔ aerial photo, the real and fake images were not generated from the same input, in order to make the task more difficult and avoid floor-level results. For map ↔ aerial photo, we trained on 256 × 256 reso-\n\nimages, but exploited fully-convolutional translation (described above) to test on 512 × 512 images, which were then downsampled and presented to Turkers at 256 × 256 resolution. For colorization, we trained and tested on 256 × 256 resolution images and presented the results to Turkers at this same resolution.\n\n'FCN-score' While quantitative evaluation of generative models is known to be challenging, recent works [52, 55, 62, 42] have tried using pre-trained semantic classifiers to measure the discriminability of the generated stimuli as a pseudo-metric. The intuition is that if the generated images are realistic, classifiers trained on real images will be able to classify the synthesized image correctly as well. To this end, we adopt the popular FCN-8s [39] architecture for semantic segmentation, and train it on the cityscapes dataset. Wethen score synthesized photos by the classification accuracy against the labels these photos were synthesized from.",
        "metadata": {
            "section_header": "Evaluation metrics",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.2. Analysis of the objective function\n\nWhich components of the objective in Eqn. 4 are important? We run ablation studies to isolate the effect of the L1 term, the GAN term, and to compare using a discriminator conditioned on the input (cGAN, Eqn. 1) against using an unconditional discriminator (GAN, Eqn. 2).\n\nFigure 5: Adding skip connections to an encoder-decoder to create a 'U-Net' results in much higher quality results.\n\n<!-- image -->\n\nTable 3: FCN-scores for different receptive field sizes of the discriminator, evaluated on Cityscapes labels → photos. Note that input images are 256 × 256 pixels and larger receptive fields are padded with zeros.\n\n| Loss    |   Per-pixel acc. |   Per-class acc. |   Class IOU |\n|---------|------------------|------------------|-------------|\n| L1      |             0.42 |             0.15 |        0.11 |\n| GAN     |             0.22 |             0.05 |        0.01 |\n| cGAN    |             0.57 |             0.22 |        0.16 |\n| L1+GAN  |             0.64 |             0.2  |        0.15 |\n| L1+cGAN |             0.66 |             0.23 |        0.17 |\n|         |             0.8  |             0.26 |        0.21 |\n\nGround truth\n\nTable 1: FCN-scores for different losses, evaluated on Cityscapes labels ↔ photos.\n\n| Loss                      |   Per-pixel acc. |   Per-class acc. |   Class IOU |\n|---------------------------|------------------|------------------|-------------|\n| Encoder-decoder (L1)      |             0.35 |             0.12 |        0.08 |\n| Encoder-decoder (L1+cGAN) |             0.29 |             0.09 |        0.05 |\n| U-net (L1)                |             0.48 |             0.18 |        0.13 |\n| U-net (L1+cGAN)           |             0.55 |             0.2  |        0.14 |\n\nTable 2: FCN-scores for different generator architectures (and objectives), evaluated on Cityscapes labels ↔ photos. (U-net (L1cGAN)scores differ from those reported in other tables since batch size was 10 for this experiment and 1 for other tables, and random variation between training runs.)\n\n| Discriminator receptive field   |   Per-pixel acc. |   Per-class acc. |   Class IOU |\n|---------------------------------|------------------|------------------|-------------|\n| 1 × 1                           |             0.39 |             0.15 |        0.1  |\n| 16 × 16                         |             0.65 |             0.21 |        0.17 |\n| 70 × 70                         |             0.66 |             0.23 |        0.17 |\n| 286 286                         |             0.42 |             0.16 |        0.11 |\n\n×\n\nFigure 4 shows the qualitative effects of these variations on two labels → photo problems. L1 alone leads to reasonable but blurry results. The cGAN alone (setting λ = 0 in Eqn. 4) gives much sharper results but introduces visual artifacts on certain applications. Adding both terms together (with λ = 100 ) reduces these artifacts.\n\nWe quantify these observations using the FCN-score on the cityscapes labels → photo task (Table 1): the GAN-based objectives achieve higher scores, indicating that the synthesized images include more recognizable structure. We also test the effect of removing conditioning from the discriminator (labeled as GAN). In this case, the loss does not penalize mismatch between the input and output; it only cares\n\nthat the output look realistic. This variant results in poor performance; examining the results reveals that the generator collapsed into producing nearly the exact same output regardless of input photograph. Clearly, it is important, in this case, that the loss measure the quality of the match between input and output, and indeed cGAN performs much better than GAN. Note, however, that adding an L1 term also encourages that the output respect the input, since the L1 loss penalizes the distance between ground truth outputs, which correctly match the input, and synthesized outputs, which may not. Correspondingly, L1+GAN is also effective at creating realistic renderings that respect the input label maps. Combining all terms, L1+cGAN, performs similarly well.\n\nColorfulness A striking effect of conditional GANs is that they produce sharp images, hallucinating spatial structure even where it does not exist in the input label map. One might imagine cGANs have a similar effect on 'sharpening' in the spectral dimension - i.e. making images more colorful. Just as L1 will incentivize a blur when it is uncertain where exactly to locate an edge, it will also incentivize an average, grayish color when it is uncertain which of several plausible color values a pixel should take on. Specially, L1 will be minimized by choosing the median of the conditional probability density function over possible colors. An adversarial loss, on the other hand, can in principle become aware that grayish outputs are unrealistic, and encourage matching the true color distribution [24]. In Figure 7, we investigate whether our cGANs actually achieve this effect on the Cityscapes dataset. The plots show the marginal distributions over output color values in Lab color space. The ground truth distributions are shown with a dotted line. It is apparent that L1 leads to a narrower distribution than the ground truth, confirming the hypothesis that L1 encourages average, grayish colors. Using a cGAN, on the other hand, pushes the output distribution closer to the ground truth.",
        "metadata": {
            "section_header": "Analysis of the objective function",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.3. Analysis of the generator architecture\n\nA U-Net architecture allows low-level information to shortcut across the network. Does this lead to better results? Figure 5 and Table 2 compare the U-Net against an encoderdecoder on cityscape generation. The encoder-decoder is created simply by severing the skip connections in the UNet. The encoder-decoder is unable to learn to generate realistic images in our experiments. The advantages of the U-Net appear not to be specific to conditional GANs: when both U-Net and encoder-decoder are trained with an L1 loss, the U-Net again achieves the superior results.",
        "metadata": {
            "section_header": "Analysis of the generator architecture",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.4. From PixelGANs to PatchGANs to ImageGANs\n\nWe test the effect of varying the patch size N of our discriminator receptive fields, from a 1 × 1 'PixelGAN' to a\n\nCV\n\nCVPR R\n\nCVP PR\n\n#3\n\n#385 5\n\n#38 85\n\n648 8\n\n64 48\n\n6\n\n649 9\n\n64 49\n\n6\n\n650 0\n\n65 50\n\n6\n\n651 1\n\n65 51\n\n6\n\n652 2\n\n65 52\n\n6\n\n653 3\n\n65 53\n\n6\n\n654 4\n\n65 54\n\n6\n\n655 5\n\n65 55\n\n6\n\n656 6\n\n657 7\n\n65 56\n\n6\n\n65 57\n\n6\n\n65 58\n\n658 8\n\n659 9\n\n6\n\n65 59\n\n6\n\n66 60\n\n660 0\n\n661 1\n\n6\n\n66 61\n\n6\n\n66 62\n\n662 2\n\n663 3\n\n6\n\n66 63\n\n6\n\n66 64\n\n664 4\n\n665 5\n\n6\n\n66 65\n\n6\n\n66 66\n\n666 6\n\n667 7\n\n6\n\n66 67\n\n6\n\n66 68\n\n668 8\n\n6\n\n66 69\n\n669 9\n\n6\n\n670 0\n\n670\n\n671\n\n67\n\n671 1\n\n67\n\n672 2\n\n672\n\n673\n\n67\n\n67\n\n673 3\n\n67\n\n674\n\n675\n\n674 4\n\n67\n\n675 5\n\n67\n\n676\n\n677\n\n676 6\n\n67\n\n677\n\n678\n\n678 7\n\n679\n\n679 8\n\n67\n\n67\n\n68\n\n680 9\n\n680\n\n681\n\n681 0\n\n682\n\n682 1\n\n68\n\n68\n\n683 2\n\n68\n\n684 3\n\n683\n\n684\n\n685\n\n685 4\n\n68\n\n68\n\n686 5\n\n68\n\n687 6\n\n686\n\n687\n\n688\n\n688 7\n\n68\n\n68\n\n689 8\n\n68\n\n690 9\n\n689\n\n690\n\n691\n\n691 0\n\n69\n\n69\n\n692 1\n\n69\n\n6932\n\n692\n\n693\n\n694\n\n6943\n\n69\n\n6954\n\n69\n\n6965\n\n695\n\n696\n\n69\n\n697 6\n\n69\n\n69\n\n698\n\n698 7\n\n69 7\n\nFigure 8: Applying a conditional GAN to semantic segmentat\n\n<!-- image -->\n\nL\n\nL\n\nL\n\nL\n\nL\n\nL\n\nFigure 6: Patch size variations. Uncertainty in the output manifests itself differently for different loss functions. Uncertain regions become blurry and desaturated under L1. The 1x1 PixelGAN encourages greater color diversity but has no effect on spatial statistics. The 16x16 PatchGAN creates locally sharp results, but also leads to tiling artifacts beyond the scale it can observe. The 70 × 70 PatchGAN forces outputs that are sharp, even if incorrect, in both the spatial and spectral (colorfulness) dimensions. The full 286 × 286 ImageGAN produces results that are visually similar to the 70 × 70 PatchGAN, but somewhat lower quality according to our FCN-score metric (Table 3). Please see https://phillipi.github.io/pix2pix/ for additional examples. CVPR 2016 Submission #385. CONFIDENTIAL REVIEW COPY. DO NOT DISTRIBUTE. TE. . 0 20 40 60 80 100 -11 -9 -7 -5 -3 -1 L1 cGAN L1+cGAN L1+pixelcGAN Ground truth 0 20 40 60 80 100 -11 -9 -7 -5 -3 -1 L1 cGAN L1+cGAN L1+pixelcGAN Ground truth CVPR 2016 Submission #385. CONFIDENTIAL REVIEW COPY. DO NOT DISTRIBU UTE 0 20 40 60 80 100 -11 -9 -7 -5 -3 -1 L1 cGAN L1+cGAN L1+pixelcGAN Ground truth 0 20 40 60 80 100 -11 -9 -7 -5 -3 -1 L1 cGAN L1+cGAN L1+pixelcGAN Ground truth CVPR 2016 Submission #385. CONFIDENTIAL REVIEW COPY. DO NOT DISTRIB 0 20 40 60 80 100 -11 -9 -7 -5 -3 -1 L1 cGAN L1+cGAN L1+pixelcGAN Ground truth 0 20 40 60 80 100 -11 -9 -7 -5 -3 -1 L1 cGAN L1+cGAN L1+pixelcGAN Ground truth\n\nL\n\nb\n\na\n\nb\n\na\n\nL\n\nb\n\na\n\nb\n\na\n\nb\n\na\n\nb\n\na\n\n<!-- image -->\n\nL\n\n-9 -7 -5 -3 -9 -7 -5 -3 that the histogram intersection scores are dominated by differences in the high probability region, which are imperceptible in the plots, ots, , which show log probability and therefore emphasize differences in the low probability regions. ns. . L1 1 1x1 1 16x16 16 6 70x70 70 0 256x25656 6 -9 -7 -5 -3 -9 -7 -5 -3 that the histogram intersection scores are dominated by differences in the high probability region, which are imperceptible in the pl lots which show log probability and therefore emphasize differences in the low probability regio ons L L1 1x x1 16x x1 70x x7 256x2 25 -9 -7 -5 -3 -9 -7 -5 -3 that the histogram intersection scores are dominated by differences in the high probability region, which are imperceptible in the p which show log probability and therefore emphasize differences in the low probability regi 1 16 70 256x Figure 7: Color distribution matching property of the cGAN, tested on Cityscapes. (c.f. Figure 1 of the original GAN paper [24]). Note that the histogram intersection scores are dominated by differences in the high probability region, which are imperceptible in the plots, which show log probability and therefore emphasize differences in the low probability regions.\n\nFigure 5: Col\n\n(\n\nFigure 1 of the original GAN paper [\n\n-\n\n11\n\n-\n\n11\n\n-\n\n11\n\n70\n\n90\n\n110\n\n130\n\n150\n\n70\n\n90\n\n110\n\n130\n\n150\n\n70\n\n90\n\n110\n\n130\n\n150\n\n-\n\n11\n\n-\n\n11\n\n-\n\n11\n\n70\n\n90\n\n110\n\n130\n\n70\n\n90\n\n110\n\n130\n\n70\n\n90\n\n110\n\n130\n\nFigure 6: Patch size variations. Uncertainty in the output manifests itself differently for different loss functions. Uncertain regions become me e blurry and desaturated under L1. The 1x1 PixelGAN encourages greater color diversity but has no effect on spatial statistics. cs. . The 16x x1 The 16x16 16 6 PatchGAN creates locally sharp results, but also leads to tiling artifacts beyond the scale it can observe. Figure 6: Patch size variations. Uncertainty in the output manifests itself differently for different loss functions. Uncertain regions beco om blurry and desaturated under L1. The 1x1 PixelGAN encourages greater color diversity but has no effect on spatial statisti tics Figure 6: Patch size variations. Uncertainty in the output manifests itself differently for different loss functions. Uncertain regions bec blurry and desaturated under L1. The 1x1 PixelGAN encourages greater color diversity but has no effect on spatial statis The 16 full 286 × 286 'ImageGAN' 1 . Figure 6 shows qualitative results of this analysis and Table 3 quantifies the effects using the FCN-score. Note that elsewhere in this paper, unless specified, all experiments use 70 × 70 PatchGANs, and for this section all experiments use an L1+cGAN loss. Photo → Map Map → Photo Loss %Turkers labeled real %Turkers labeled real L1 2.8% ± 1.0% 0.8% ± 0.3% L1+cGAN 6.1% ± 1.3% 18.9% ± 2.5% Table 4: AMT 'real vs fake' test on maps ↔ aerial photos.\n\nFigure 1 of the original GAN paper [14]). 4]). ). N Not\n\nFigure 1 of the original GAN paper [1 14]\n\nInp pu\n\nGround tru ut\n\ncG GAN\n\nIn\n\nGround tr\n\nL\n\nc\n\nFigure 8: Applying a conditional GAN to semantic segmentation. Figure 8: Applying a conditional GAN to semantic segmentation. generator convolutionally, on larger images than those on which it was trained. We test this on the map ↔ aerial photo task. After training a generator on 256 × 256 images, we test it on 512 × 512 images. The results in Figure 8 demonstrate the effectiveness of this approach.\n\nThe 70x70 PatchGAN forces ces s outputs that are sharp, even if incorrect, in both the spatial and spectral (coforfulness) dimensions. The full 256x256 ImageGAN produces ces s results that are visually similar to the 70x70 PatchGAN, but somewhat lower quality according to our FCN-score metric (Table 2). 2). . Classification Ours rs L2 [44] ] ] (rebal.) [44] on histogram (L1 + cGAN) ) ) Ground truth h Input ut t Ground truth th h L1 L1 1 cGAN AN PatchGAN creates locally sharp results, but also leads to tiling artifacts beyond the scale it can observe. . The 70x70 PatchGAN for rce outputs that are sharp, even if incorrect, in both the spatial and spectral (coforfulness) dimensions. The full 256x256 ImageGAN produ uce results that are visually similar to the 70x70 PatchGAN, but somewhat lower quality according to our FCN-score metric (Table e 2) Classification Ou urs L2 [44 GAN loss. (rebal.) [44] ] (L1 + cGAN atching is a Ground trut th PatchGAN creates locally sharp results, but also leads to tiling artifacts beyond the scale it can observe The 70x70 PatchGAN fo outputs that are sharp, even if incorrect, in both the spatial and spectral (coforfulness) dimensions. The full 256x256 ImageGAN prod results that are visually similar to the 70x70 PatchGAN, but somewhat lower quality according to our FCN-score metric (Tabl Classificati lor O L2 [44 (rebal.) [44 (L1 + cGAN Ground tru The PixelGAN has no effect on spatial sharpness but does increase the colorfulness of the results (quantified in Figure 7). For example, the bus in Figure 6 is painted gray when the net is trained with an L1 loss, but becomes red with the Pixel Co m common problem in image processing [49], and PixelGANs may be a promising lightweight solution. Method %Turkers labeled real L2 regression from [62] 16.3% ± 2.4% Zhang et al. 2016 [62] 27.8% ± 2.7% Ours 22.5% ± 1.6% Table 5: AMT 'real vs fake' test on colorization.\n\nUsing a 16 × 16 PatchGAN is sufficient to promote sharp outputs, and achieves good FCN-scores, but also leads to tiling artifacts. The 70 × 70 PatchGAN alleviates these artifacts and achieves slightly better scores. Scaling beyond this, to the full 286 × 286 ImageGAN, does not appear to improve the visual quality of the results, and in fact gets a considerably lower FCN-score (Table 3). This may be because the ImageGAN has many more parameters and greater depth than the 70 × 70 PatchGAN, and may be harder to train.\n\nFigure 7: Colorization results of conditional GANs versus the L2 Figure 7: Colorization results of conditional GANs versus the L2 Fully-convolutional translation An advantage of the PatchGAN is that a fixed-size patch discriminator can be applied to arbitrarily large images. We may also apply the\n\nregression from [44] and the full method (classification with re- L2\n\nFigure 7: Colorization results of conditional GANs versus the\n\nproducing a grayscale or desaturated result (last row).\n\nproducing a grayscale or desaturated result (last row).\n\nTo begin to test this, we train a cGAN (with/without L1\n\nTo begin to t\n\nst this, we train a cGAN (with/without\n\nloss) on cityscape photo we train a cGAN (with/without L1\n\nlabels.\n\nFigure 8 shows qualita- L1\n\nTo begin to test this,\n\nloss) on cityscape photo\n\n→\n\nlabels.\n\nFigure 8 shows qualita-\n\ntive results, and quantitative classification accu\n\ntive results, and quantitative classification accuracies are re- ta-\n\nloss) on cityscape photo\n\nlabels.\n\nFigure 8 shows quali\n\nwithout\n\nthe re-\n\ntive results, and quantitative classification accuracies are\n\n→ →\n\nported in Table 4. Interestingly, cGANs, trained\n\nwithout\n\nthe\n\nported in Table 4. Interestingly, cGANs, trained racies are re-\n\nThe cGAN produces sharp images that look at glance like the ion.\n\nground truth, but in fact include many small, hallucinated objects. .",
        "metadata": {
            "section_header": "From PixelGANs to PatchGANs to ImageGANs",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## ground truth, but in fact include many small, hallucinated objects. The cGAN produces sharp images that look at glance like the e The cGAN produces sharp images that look at glance like th 4.5. Perceptual validation\n\nnearly discrete, rather than 'images', with their continuousvalued variation. , rather than 'images', with their continuousAlthough cGANs achieve some success, they are far from the best available method for solving this ess, problem: simply using L1 regression gets better scores than this using a cGAN, as shown in Table 4. We argue that for vision han problems, the goal (i.e. wn in Table 4. We argue that for vision predicting output close to ground truth) may be less ambiguous than graphics tasks, and re- und construction losses like L1 are mostly sufficient. tasks, and renearly discrete, rather than 'images', with their continuousvalued variation. . Although cGANs achieve some success, they are far from the best available method for solving this problem: simply using L1 regression gets better scores than using a cGAN, as shown in Table 4. We argue that for vision problems, the goal (i.e. . led predicting output close to ground truth) may be less ambiguous than graphics tasks, and reconstruction losses like L1 are mostly sufficient. . t). nearly discrete valued variation Although cGANs achieve some succ d they are far from the best available method for solving problem: simply using L1 regression gets better scores t r using a cGAN, as sho contrast, in the photo problems, the goal (i.e predicting output close to gro itruth) may be less ambiguous than graphics n the perforconstruction losses like L1 are mostly sufficient s We validate the perceptual realism of our results on the tasks of map ↔ aerial photograph and grayscale → color. Results of our AMT experiment for map ↔ photo are given in Table 4. The aerial photos generated by our method foole participants on 18 9% . of trials, significantly above the L1 baseline, which produces blurry results and nearly neve fooled participants. In → map direction our method only foo participants on 6 1 . % of tr als, and this was not significantly different tha mance of the L1 baseline (based on bootstrap te This may be because minor structural errors are more visible\n\nground truth, but in fact include many small, hallucinated objects\n\n4. Conclusion\n\n4. Conclusion\n\n4. Conclusion\n\nThe results in this paper suggest that conditional adver-\n\nsarial networks are a promising approach for many image- er- -\n\nThe results in this paper suggest that conditional adv\n\nsarial networks are a promising approach for many image-\n\nThe results in this paper suggest that conditional adver\n\nto-image translation tasks, especially those involving highlyge-\n\nsarial networks are a promising approach for many ima\n\nto-image translation tasks, especially those involving highly\n\nNoteote e\n\nCVPR PR R\n\nCV VP\n\nC\n\n#385 385 5",
        "metadata": {
            "section_header": "ground truth, but in fact include many small, hallucinated objects. The cGAN produces sharp images that look at glance like the e The cGAN produces sharp images that look at glance like th 4.5. Perceptual validation",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "# #38\n\n702 702 2\n\n70\n\n703 703 3\n\n70\n\n704 704 4\n\n70\n\n705 705 5\n\n70\n\n706 706 6\n\n70\n\n707 707 7\n\n70\n\n708 708 8\n\n70\n\n709 709 9\n\n70\n\n710 710 0\n\n71\n\n71\n\n711 711 1\n\n71\n\n712 712 2\n\n71\n\n713 713 3\n\n71\n\n714 714 4\n\n71\n\n715 715 5\n\n71\n\n716 716 6\n\n71\n\n717 717 7\n\n71\n\n718 718 8\n\n71\n\n719 719 9\n\n72\n\n720 720 0\n\n72\n\n721 721 1\n\n72\n\n722 722 2\n\n72\n\n723 723 3\n\n72\n\n724 724 4\n\n72\n\n725 725 5\n\n7 72\n\n726 26 6\n\n727\n\n728\n\n727 7\n\n729\n\n728 8\n\n730\n\n72\n\n72\n\n72\n\n729 9\n\n731 730\n\n730\n\n731\n\n732\n\n732 731\n\n733\n\n733 732\n\n734\n\n734 733\n\n735\n\n735 734\n\n736\n\n736 735\n\n737 736\n\n738 737\n\n737\n\n738\n\n739\n\n739 738\n\n740 739\n\n741 740\n\n740\n\n741\n\n742\n\n742 741\n\n743742\n\n744743\n\n743\n\n744\n\n745\n\n745744\n\n746745\n\n747746\n\n746\n\n747\n\n748747\n\n749 48 8\n\n7 74\n\n749\n\n750 749\n\n750\n\n751 750\n\n751\n\n752\n\n752 751\n\ninput\n\noutput\n\ninput\n\noutput\n\nFigure 8: Example results on Google Maps at 512x512 resolution (model was trained on images at 256 × 256 resolution, and run convolutionally on the larger images at test time). Contrast adjusted for clarity.\n\n<!-- image -->\n\nL2 [62]\n\n(rebal.) [62]\n\n(L1 + cGAN)\n\nGround truth\n\nClassification\n\nOurs\n\nFigure 9: Colorization results of conditional GANs versus the L2 regression from [62] and the full method (classification with rebalancing) from [64]. The cGANs can produce compelling colorizations (first two rows), but have a common failure mode of producing a grayscale or desaturated result (last row).\n\n<!-- image -->\n\nin maps, which have rigid geometry, than in aerial photographs, which are more chaotic.\n\nWe trained colorization on ImageNet [51], and tested on the test split introduced by [62, 35]. Our method, with L1+cGAN loss, fooled participants on 22 5% . of trials (Ta-\n\nFigure 10: Applying a conditional GAN to semantic segmentation. The cGAN produces sharp images that look at glance like the ground truth, but in fact include many small, hallucinated objects.\n\n<!-- image -->\n\nble 5). We also tested the results of [62] and a variant of their method that used an L2 loss (see [62] for details). The conditional GAN scored similarly to the L2 variant of [62] (difference insignificant by bootstrap test), but fell short of [62]'s full method, which fooled participants on 27 8% . of trials in our experiment. We note that their method was specifically engineered to do well on colorization.",
        "metadata": {
            "section_header": "",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.6. Semantic segmentation\n\nConditional GANs appear to be effective on problems where the output is highly detailed or photographic, as is common in image processing and graphics tasks. What\n\nFigure 11: Example applications developed by online community based on our pix2pix codebase: #edges2cats [3] by Christopher Hesse, Background removal [6] by Kaihu Chen, Palette generation [5] by Jack Qiao, Sketch → Portrait [7] by Mario Klingemann, Sketch → Pokemon [1] by Bertrand Gondouin, 'Do As I Do' pose transfer [2] by Brannon Dorsey, and #fotogenerator by Bosman et al. [4].\n\n<!-- image -->\n\nTable 6: Performance of photo → labels on cityscapes.\n\n| Loss    |   Per-pixel acc. |   Per-class acc. |   Class IOU |\n|---------|------------------|------------------|-------------|\n| L1      |             0.86 |             0.42 |        0.35 |\n| cGAN    |             0.74 |             0.28 |        0.22 |\n| L1+cGAN |             0.83 |             0.36 |        0.29 |\n\nabout vision problems, like semantic segmentation, where the output is instead less complex than the input?\n\nTo begin to test this, we train a cGAN (with/without L1 loss) on cityscape photo → labels. Figure 10 shows qualitative results, and quantitative classification accuracies are reported in Table 6. Interestingly, cGANs, trained without the L1 loss, are able to solve this problem at a reasonable degree of accuracy. To our knowledge, this is the first demonstration of GANs successfully generating 'labels', which are nearly discrete, rather than 'images', with their continuousvalued variation . Although cGANs achieve some success, 2 they are far from the best available method for solving this problem: simply using L1 regression gets better scores than using a cGAN, as shown in Table 6. We argue that for vision problems, the goal (i.e. predicting output close to the ground truth) may be less ambiguous than graphics tasks, and reconstruction losses like L1 are mostly sufficient.",
        "metadata": {
            "section_header": "Semantic segmentation",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.7. Community-driven Research\n\nSince the initial release of the paper and our pix2pix codebase, the Twitter community, including computer vision and graphics practitioners as well as visual artists, have successfully applied our framework to a variety of novel image-to-image translation tasks, far beyond the scope of the original paper. Figure 11 and Figure 12 show just a few examples from the #pix2pix hashtag, including Background removal , Palette generation , Sketch → Portrait , Sketch → Pokemon , 'Do as I Do' pose transfer , Learning to see: Gloomy Sunday , as well as the bizarrely popular #edges2cats and #fotogenerator. Note that these applications are creative projects, were not obtained in controlled, scientific conditions, and may rely on some modifications to\n\nFigure 12: Learning to see: Gloomy Sunday : An interactive artistic demo developed by Memo Akten [8] based on our pix2pix codebase. Please click the image to play the video in a browser.\n\n<!-- image -->\n\nthe pix2pix code we released. Nonetheless, they demonstrate the promise of our approach as a generic commodity tool for image-to-image translation problems.",
        "metadata": {
            "section_header": "Community-driven Research",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 5. Conclusion\n\nThe results in this paper suggest that conditional adversarial networks are a promising approach for many imageto-image translation tasks, especially those involving highly structured graphical outputs. These networks learn a loss adapted to the task and data at hand, which makes them applicable in a wide variety of settings.\n\nAcknowledgments: We thank Richard Zhang, Deepak Pathak, and Shubham Tulsiani for helpful discussions, Saining Xie for help with the HED edge detector, and the online community for exploring many applications and suggesting improvements. Thanks to Christopher Hesse, Memo Akten, Kaihu Chen, Jack Qiao, Mario Klingemann, Brannon Dorsey, Gerda Bosman, Ivy Tsai, and Yann LeCun for allowing the use of their creations in Figure 11 and Figure 12. This work was supported in part by NSF SMA-1514512, NGANURI,IARPA via Air Force Research Laboratory, Intel Corp, Berkeley Deep Drive, and hardware donations by Nvidia. J.-Y.Z. is supported by the Facebook Graduate Fellowship. Disclaimer: The views and conclusions contained herein are those of the authors and should not be interpreted as necessarily representing the official policies or endorsements, either expressed or implied, of IARPA, AFRL or the U.S. Government.\n\n<!-- image -->\n\nFigure 13: Example results of our method on Cityscapes labels → photo, compared to ground truth.\n\n<!-- image -->\n\nFigure 14: Example results of our method on facades labels → photo, compared to ground truth.\n\n<!-- image -->\n\nFigure 15: Example results of our method on day → night, compared to ground truth.\n\n<!-- image -->\n\nFigure 16: Example results of our method on automatically detected edges → handbags, compared to ground truth.\n\n<!-- image -->\n\nFigure 17: Example results of our method on automatically detected edges → shoes, compared to ground truth.\n\n<!-- image -->\n\nFigure 18: Additional results of the edges → photo models applied to human-drawn sketches from [19]. Note that the models were trained on automatically detected edges, but generalize to human drawings\n\n<!-- image -->\n\nFigure 19: Example results on photo inpainting, compared to [43], on the Paris StreetView dataset [14]. This experiment demonstrates that the U-net architecture can be effective even when the predicted pixels are not geometrically aligned with the information in the input - the information used to fill in the central hole has to be found in the periphery of these photos.\n\n<!-- image -->\n\nFigure 20: Example results on translating thermal images to RGB photos, on the dataset from [27].\n\n<!-- image -->\n\nFigure 21: Example failure cases. Each pair of images shows input on the left and output on the right. These examples are selected as some of the worst results on our tasks. Common failures include artifacts in regions where the input image is sparse, and difficulty in handling unusual inputs. Please see https://phillipi.github.io/pix2pix/ for more comprehensive results.\n\n<!-- image -->",
        "metadata": {
            "section_header": "Conclusion",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6. Appendix",
        "metadata": {
            "section_header": "Appendix",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.1. Network architectures\n\nWe adapt our network architectures from those in [44]. Code for the models is available at https://github.com/phillipi/pix2pix .\n\nLet Ck denote a Convolution-BatchNorm-ReLU layer with k filters. CDk denotes a Convolution-BatchNormDropout-ReLU layer with a dropout rate of 50% . All convolutions are 4 × 4 spatial filters applied with stride 2. Convolutions in the encoder, and in the discriminator, downsample by a factor of 2, whereas in the decoder they upsample by a factor of 2.",
        "metadata": {
            "section_header": "Network architectures",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.1.1 Generator architectures\n\nThe encoder-decoder architecture consists of: encoder:\n\nC64-C128-C256-C512-C512-C512-C512-C512",
        "metadata": {
            "section_header": "Generator architectures",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## decoder:\n\nCD512-CD512-CD512-C512-C256-C128-C64\n\nAfter the last layer in the decoder, a convolution is applied to map to the number of output channels (3 in general, except in colorization, where it is 2), followed by a Tanh function. As an exception to the above notation, BatchNorm is not applied to the first C64 layer in the encoder. All ReLUs in the encoder are leaky, with slope 0.2, while ReLUs in the decoder are not leaky.\n\nThe U-Net architecture is identical except with skip connections between each layer i in the encoder and layer n -i in the decoder, where n is the total number of layers. The skip connections concatenate activations from layer i to layer n -i . This changes the number of channels in the decoder:",
        "metadata": {
            "section_header": "decoder:",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## U-Net decoder:\n\nCD512-CD1024-CD1024-C1024-C1024-C512\n\n-C256-C128",
        "metadata": {
            "section_header": "U-Net decoder:",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.1.2 Discriminator architectures\n\nThe 70 × 70 discriminator architecture is: C64-C128-C256-C512\n\nAfter the last layer, a convolution is applied to map to a 1-dimensional output, followed by a Sigmoid function. As an exception to the above notation, BatchNorm is not applied to the first C64 layer. All ReLUs are leaky, with slope 0.2.\n\nAll other discriminators follow the same basic architecture, with depth varied to modify the receptive field size:",
        "metadata": {
            "section_header": "Discriminator architectures",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1 × 1 discriminator:\n\n16 × 16 discriminator:\n\nC64-C128 (note, in this special case, all convolutions are 1 × 1 spatial filters)\n\nC64-C128",
        "metadata": {
            "section_header": "discriminator:",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 286 × 286 discriminator:\n\nC64-C128-C256-C512-C512-C512",
        "metadata": {
            "section_header": "discriminator:",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.2. Training details\n\nRandom jitter was applied by resizing the 256 × 256 input images to 286 × 286 and then randomly cropping back to size 256 × 256 .\n\nAll networks were trained from scratch. Weights were initialized from a Gaussian distribution with mean 0 and standard deviation 0.02.\n\nCityscapes labels → photo 2975 training images from the Cityscapes training set [12], trained for 200 epochs, with random jitter and mirroring. We used the Cityscapes validation set for testing. To compare the U-net against an encoder-decoder, we used a batch size of 10, whereas for the objective function experiments we used batch size 1. We find that batch size 1 produces better results for the Unet, but is inappropriate for the encoder-decoder. This is because we apply batchnorm on all layers of our network, and for batch size 1 this operation zeros the activations on the bottleneck layer. The U-net can skip over the bottleneck, but the encoder-decoder cannot, and so the encoder-decoder requires a batch size greater than 1. Note, an alternative strategy is to remove batchnorm from the bottleneck layer. See errata for more details.\n\nArchitectural labels → photo 400 training images from [45], trained for 200 epochs, batch size 1, with random jitter and mirroring. Data were split into train and test randomly.\n\nMaps ↔ aerial photograph 1096 training images scraped from Google Maps, trained for 200 epochs, batch size 1, with random jitter and mirroring. Images were sampled from in and around New York City. Data were then split into train and test about the median latitude of the sampling region (with a buffer region added to ensure that no training pixel appeared in the test set).\n\nBW → color 1.2 million training images (Imagenet training set [51]), trained for ∼ 6 epochs, batch size 4, with only mirroring, no random jitter. Tested on subset of Imagenet val set, following protocol of [62] and [35].\n\nEdges → shoes 50k training images from UT Zappos50K dataset [61] trained for 15 epochs, batch size 4. Data were split into train and test randomly.\n\nEdges → Handbag 137K Amazon Handbag images from [65], trained for 15 epochs, batch size 4. Data were split into train and test randomly.\n\nDay → night 17823 training images extracted from 91 webcams, from [33] trained for 17 epochs, batch size 4, with random jitter and mirroring. We use 91 webcams as training, and 10 webcams for test.\n\nThermal → color photos 36609 training images from set 00-05 of [27], trained for 10 epochs, batch size 4. Images from set 06-11 are used for testing.\n\nPhoto with missing pixels → inpainted photo 14900 training images from [14], trained for 25 epochs, batch size 4, and tested on 100 held out images following the split of [43].",
        "metadata": {
            "section_header": "Training details",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.3. Errata\n\nFor all experiments reported in this paper with batch size 1, the activations of the bottleneck layer are zeroed by the batchnorm operation, effectively making the innermost layer skipped. This issue can be fixed by removing batchnorm from this layer, as has been done in the public code. We observe little difference with this change and therefore leave the experiments as is in the paper.",
        "metadata": {
            "section_header": "Errata",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 6.4. Change log\n\narXiv v2 Reran generator architecture comparisons (Section 4.3) with batch size equal to 10 rather than 1, so that bottleneck layer is not zeroed (see Errata). Reran FCN-scores with minor details cleaned up (results saved losslessly as pngs, removed unecessary downsampling). FCN-scores computed using scripts at https://github.com/phillipi/pix2pix/tree/ master/scripts/eval cityscapes , commit d7e7b8b. Updated several figures and text. Added additional results on thermal → color photos and inpainting, as well as community contributions. arXiv v3 Added additional results on community contri-\n\nbutions. Fixed minor typos.",
        "metadata": {
            "section_header": "Change log",
            "title": "Image-to-Image Translation with Conditional Adversarial Networks",
            "type": "paper"
        }
    }
]