[
    {
        "page_content": "## 1 Rutgers University 2 Lehigh University 3 The Chinese University of Hong Kong 4\n\nhan.zhang, dnm @cs.rutgers.edu, } { tax313, } { hsli, xgwang @ee.cuhk.edu.hk, } zhangshaoting@baidu.com\n\nBaidu Research { xih206 @lehigh.edu",
        "metadata": {
            "section_header": "Rutgers University 2 Lehigh University 3 The Chinese University of Hong Kong 4",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## Abstract\n\nSynthesizing high-quality images from text descriptions is a challenging problem in computer vision and has many practical applications. Samples generated by existing textto-image approaches can roughly reflect the meaning of the given descriptions, but they fail to contain necessary details and vivid object parts. In this paper, we propose Stacked Generative Adversarial Networks (StackGAN) to generate 256 × 256 photo-realistic images conditioned on text descriptions. We decompose the hard problem into more manageable sub-problems through a sketch-refinement process. The Stage-I GAN sketches the primitive shape and colors of the object based on the given text description, yielding Stage-I low-resolution images. The Stage-II GAN takes Stage-I results and text descriptions as inputs, and generates high-resolution images with photo-realistic details. It is able to rectify defects in Stage-I results and add compelling details with the refinement process. To improve the diversity of the synthesized images and stabilize the training of the conditional-GAN, we introduce a novel Conditioning Augmentation technique that encourages smoothness in the latent conditioning manifold. Extensive experiments and comparisons with state-of-the-arts on benchmark datasets demonstrate that the proposed method achieves significant improvements on generating photo-realistic images conditioned on text descriptions.",
        "metadata": {
            "section_header": "Abstract",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 1. Introduction\n\nGenerating photo-realistic images from text is an important problem and has tremendous applications, including photo-editing, computer-aided design, etc . Recently, Generative Adversarial Networks (GAN) [8, 5, 23] have shown promising results in synthesizing real-world images. Conditioned on given text descriptions, conditional-\n\nFigure 1. Comparison of the proposed StackGAN and a vanilla one-stage GAN for generating 256 × 256 images. (a) Given text descriptions, Stage-I of StackGAN sketches rough shapes and basic colors of objects, yielding low-resolution images. (b) Stage-II of StackGAN takes Stage-I results and text descriptions as inputs, and generates high-resolution images with photo-realistic details. (c) Results by a vanilla 256 × 256 GAN which simply adds more upsampling layers to state-of-the-art GAN-INT-CLS [26]. It is unable to generate any plausible images of 256 × 256 resolution.\n\n<!-- image -->\n\nGANs [26, 24] are able to generate images that are highly related to the text meanings.\n\nHowever, it is very difficult to train GAN to generate high-resolution photo-realistic images from text descriptions. Simply adding more upsampling layers in state-ofthe-art GAN models for generating high-resolution ( e.g ., 256 × 256) images generally results in training instability\n\nand produces nonsensical outputs (see Figure 1(c)). The main difficulty for generating high-resolution images by GANs is that supports of natural image distribution and implied model distribution may not overlap in high dimensional pixel space [31, 1]. This problem is more severe as the image resolution increases. Reed et al . only succeeded in generating plausible 64 × 64 images conditioned on text descriptions [26], which usually lack details and vivid object parts, e.g ., beaks and eyes of birds. Moreover, they were unable to synthesize higher resolution ( e.g ., 128 × 128) images without providing additional annotations of objects [24].\n\nIn analogy to how human painters draw, we decompose the problem of text to photo-realistic image synthesis into two more tractable sub-problems with Stacked Generative Adversarial Networks (StackGAN). Low-resolution images are first generated by our Stage-I GAN (see Figure 1(a)). On the top of our Stage-I GAN, we stack Stage-II GAN to generate realistic high-resolution ( e.g ., 256 × 256) images conditioned on Stage-I results and text descriptions (see Figure 1(b)). By conditioning on the Stage-I result and the text again, Stage-II GAN learns to capture the text information that is omitted by Stage-I GAN and draws more details for the object. The support of model distribution generated from a roughly aligned low-resolution image has better probability of intersecting with the support of image distribution. This is the underlying reason why Stage-II GAN is able to generate better high-resolution images.\n\nIn addition, for the text-to-image generation task, the limited number of training text-image pairs often results in sparsity in the text conditioning manifold and such sparsity makes it difficult to train GAN. Thus, we propose a novel Conditioning Augmentation technique to encourage smoothness in the latent conditioning manifold. It allows small random perturbations in the conditioning manifold and increases the diversity of synthesized images.\n\nThe contribution of the proposed method is threefold: (1) We propose a novel Stacked Generative Adversarial Networks for synthesizing photo-realistic images from text descriptions. It decomposes the difficult problem of generating high-resolution images into more manageable subproblems and significantly improve the state of the art. The StackGAN for the first time generates images of 256 × 256 resolution with photo-realistic details from text descriptions. (2) A new Conditioning Augmentation technique is proposed to stabilize the conditional GAN training and also improves the diversity of the generated samples. (3) Extensive qualitative and quantitative experiments demonstrate the effectiveness of the overall model design as well as the effects of individual components, which provide useful information for designing future conditional GAN models. Our code is available at https://github.com/hanzhanggit/StackGAN.",
        "metadata": {
            "section_header": "Introduction",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3. Stacked Generative Adversarial Networks\n\nTo generate high-resolution images with photo-realistic details, we propose a simple yet effective Stacked Generative Adversarial Networks. It decomposes the text-to-image generative process into two stages (see Figure 2).\n\n- -Stage-I GAN: it sketches the primitive shape and basic colors of the object conditioned on the given text description, and draws the background layout from a random noise vector, yielding a low-resolution image.\n- -Stage-II GAN: it corrects defects in the low-resolution image from Stage-I and completes details of the object by reading the text description again, producing a highresolution photo-realistic image.",
        "metadata": {
            "section_header": "Stacked Generative Adversarial Networks",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.1. Preliminaries\n\nGenerative Adversarial Networks (GAN) [8] are composed of two models that are alternatively trained to compete with each other. The generator G is optimized to reproduce the true data distribution p data by generating images that are difficult for the discriminator D to differentiate from real images. Meanwhile, D is optimized to distinguish real images and synthetic images generated by G . Overall, the training procedure is similar to a two-player min-max game with the following objective function,\n\n<!-- formula-not-decoded -->\n\nwhere x is a real image from the true data distribution p data , and z is a noise vector sampled from distribution p z ( e.g ., uniform or Gaussian distribution).\n\nConditional GAN [7, 19] is an extension of GAN where both the generator and discriminator receive additional conditioning variables c , yielding G z, c ( ) and D x,c ( ) . This formulation allows G to generate images conditioned on variables c .",
        "metadata": {
            "section_header": "Preliminaries",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.2. Conditioning Augmentation\n\nAs shown in Figure 2, the text description t is first encoded by an encoder, yielding a text embedding ϕ t . In previous works [26, 24], the text embedding is nonlinearly transformed to generate conditioning latent variables as the input of the generator. However, latent space for the text embedding is usually high dimensional ( &gt; 100 dimensions). With limited amount of data, it usually causes discontinuity in the latent data manifold, which is not desirable for learning the generator. To mitigate this problem, we introduce a Conditioning Augmentation technique to produce additional conditioning variables ˆ c . In contrast to the fixed conditioning text variable c in [26, 24], we randomly sample the latent variables ˆ c from an independent Gaussian distribution N ( µ ϕ ( t ) , Σ( ϕ t )) , where the mean µ ϕ ( t ) and diagonal covariance matrix Σ( ϕ t ) are functions of the text embedding ϕ t . The proposed Conditioning Augmentation yields more training pairs given a small number of imagetext pairs, and thus encourages robustness to small perturbations along the conditioning manifold. To further enforce the smoothness over the conditioning manifold and avoid overfitting [6, 14], we add the following regularization term to the objective of the generator during training,\n\n<!-- formula-not-decoded -->\n\nwhich is the Kullback-Leibler divergence (KL divergence) between the standard Gaussian distribution and the conditioning Gaussian distribution. The randomness introduced in the Conditioning Augmentation is beneficial for modeling text to image translation as the same sentence usually corresponds to objects with various poses and appearances.",
        "metadata": {
            "section_header": "Conditioning Augmentation",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.3. Stage-I GAN\n\nInstead of directly generating a high-resolution image conditioned on the text description, we simplify the task to first generate a low-resolution image with our Stage-I GAN, which focuses on drawing only rough shape and correct colors for the object.\n\nLet ϕ t be the text embedding of the given description, which is generated by a pre-trained encoder [25] in this paper. The Gaussian conditioning variables ˆ c 0 for text embedding are sampled from N ( µ 0 ( ϕ t ) , Σ ( 0 ϕ t )) to capture the meaning of ϕ t with variations. Conditioned on ˆ c 0 and random variable z , Stage-I GAN trains the discriminator D 0 and the generator G 0 by alternatively maximizing L D 0 in Eq. (3) and minimizing L G 0 in Eq. (4),\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nwhere the real image I 0 and the text description t are from the true data distribution p data . z is a noise vector randomly sampled from a given distribution p z (Gaussian distribution in this paper). λ is a regularization parameter that balances the two terms in Eq. (4). We set λ = 1 for all our experiments. Using the reparameterization trick introduced in [13], both µ 0 ( ϕ t ) and Σ ( 0 ϕ t ) are learned jointly with the rest of the network.\n\nModel Architecture. For the generator G 0 , to obtain text conditioning variable ˆ c 0 , the text embedding ϕ t is first\n\nFigure 2. The architecture of the proposed StackGAN. The Stage-I generator draws a low-resolution image by sketching rough shape and basic colors of the object from the given text and painting the background from a random noise vector. Conditioned on Stage-I results, the Stage-II generator corrects defects and adds compelling details into Stage-I results, yielding a more realistic high-resolution image.\n\n<!-- image -->\n\nfed into a fully connected layer to generate µ 0 and σ 0 ( σ 0 are the values in the diagonal of Σ 0 ) for the Gaussian distribution N ( µ 0 ( ϕ t ) , Σ ( 0 ϕ t )) . ˆ c 0 are then sampled from the Gaussian distribution. Our N g dimensional conditioning vector ˆ c 0 is computed by ˆ c 0 = µ 0 + σ 0 glyph[circledot] glyph[epsilon1] (where glyph[circledot] is the element-wise multiplication, glyph[epsilon1] ∼ N (0 , I ) ). Then, ˆ c 0 is concatenated with a N z dimensional noise vector to generate a W 0 × H 0 image by a series of up-sampling blocks.\n\nFor the discriminator D 0 , the text embedding ϕ t is first compressed to N d dimensions using a fully-connected layer and then spatially replicated to form a M d × M d × N d tensor. Meanwhile, the image is fed through a series of down-sampling blocks until it has M d × M d spatial dimension. Then, the image filter map is concatenated along the channel dimension with the text tensor. The resulting tensor is further fed to a 1 × 1 convolutional layer to jointly learn features across the image and the text. Finally, a fullyconnected layer with one node is used to produce the decision score.",
        "metadata": {
            "section_header": "Stage-I GAN",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.4. Stage-II GAN\n\nLow-resolution images generated by Stage-I GAN usually lack vivid object parts and might contain shape distortions. Some details in the text might also be omitted in the first stage, which is vital for generating photo-realistic images. Our Stage-II GAN is built upon Stage-I GAN results to generate high-resolution images. It is conditioned on low-resolution images and also the text embedding again to correct defects in Stage-I results. The Stage-II GAN completes previously ignored text information to generate more photo-realistic details.\n\nConditioning on the low-resolution result s 0 = G 0 ( z, c ˆ ) 0 and Gaussian latent variables ˆ c , the discriminator\n\nD and generator G in Stage-II GAN are trained by alternatively maximizing L D in Eq. (5) and minimizing L G in Eq. (6),\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nDifferent from the original GAN formulation, the random noise z is not used in this stage with the assumption that the randomness has already been preserved by s 0 . Gaussian conditioning variables ˆ c used in this stage and ˆ c 0 used in Stage-I GAN share the same pre-trained text encoder, generating the same text embedding ϕ t . However, StageI and Stage-II Conditioning Augmentation have different fully connected layers for generating different means and standard deviations. In this way, Stage-II GAN learns to capture useful information in the text embedding that is omitted by Stage-I GAN.\n\nModel Architecture. We design Stage-II generator as an encoder-decoder network with residual blocks [9]. Similar to the previous stage, the text embedding ϕ t is used to generate the N g dimensional text conditioning vector ˆ c , which is spatially replicated to form a M g × M g × N g tensor. Meanwhile, the Stage-I result s 0 generated by Stage-I GAN is fed into several down-sampling blocks ( i.e ., encoder) until it has a spatial size of M g × M g . The image features and the text features are concatenated along the channel dimension. The encoded image features coupled with text features are fed into several residual blocks, which are designed to learn multi-modal representations across image and text features. Finally, a series of up-sampling layers\n\n( i.e ., decoder) are used to generate a W × H high-resolution image. Such a generator is able to help rectify defects in the input image while add more details to generate the realistic high-resolution image.\n\nFor the discriminator, its structure is similar to that of Stage-I discriminator with only extra down-sampling blocks since the image size is larger in this stage. To explicitly enforce GAN to learn better alignment between the image and the conditioning text, rather than using the vanilla discriminator, we adopt the matching-aware discriminator proposed by Reed et al . [26] for both stages. During training, the discriminator takes real images and their corresponding text descriptions as positive sample pairs, whereas negative sample pairs consist of two groups. The first is real images with mismatched text embeddings, while the second is synthetic images with their corresponding text embeddings.",
        "metadata": {
            "section_header": "Stage-II GAN",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 3.5. Implementation details\n\nThe up-sampling blocks consist of the nearest-neighbor upsampling followed by a 3 × 3 stride 1 convolution. Batch normalization [11] and ReLU activation are applied after every convolution except the last one. The residual blocks consist of 3 × 3 stride 1 convolutions, Batch normalization and ReLU. Two residual blocks are used in 128 × 128 StackGAN models while four are used in 256 × 256 models. The down-sampling blocks consist of 4 × 4 stride 2 convolutions, Batch normalization and LeakyReLU, except that the first one does not have Batch normalization.\n\nBy default, N g = 128 , N z = 100 , M g = 16 , M d = 4 , N d = 128 , W 0 = H 0 = 64 and W = H = 256 . For training, we first iteratively train D 0 and G 0 of Stage-I GAN for 600 epochs by fixing Stage-II GAN. Then we iteratively train D and G of Stage-II GAN for another 600 epochs by fixing Stage-I GAN. All networks are trained using ADAM solver with batch size 64 and an initial learning rate of 0.0002. The learning rate is decayed to 1 / 2 of its previous value every 100 epochs.",
        "metadata": {
            "section_header": "Implementation details",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4. Experiments\n\nTo validate our method, we conduct extensive quantitative and qualitative evaluations. Two state-of-the-art methods on text-to-image synthesis, GAN-INT-CLS [26] and GAWWN[24], are compared. Results by the two compared methods are generated using the code released by their authors. In addition, we design several baseline models to investigate the overall design and important components of our proposed StackGAN. For the first baseline, we directly train Stage-I GAN for generating 64 × 64 and 256 × 256 images to investigate whether the proposed stacked structure and Conditioning Augmentation are beneficial. Then we modify our StackGAN to generate 128 × 128 and 256 × 256 images to investigate whether larger images by our method result in higher image quality. We also investigate whether inputting text at both stages of StackGAN is useful.",
        "metadata": {
            "section_header": "Experiments",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.1. Datasets and evaluation metrics\n\nCUB [35] contains 200 bird species with 11,788 images. Since 80% of birds in this dataset have object-image size ratios of less than 0.5 [35], as a pre-processing step, we crop all images to ensure that bounding boxes of birds have greater-than-0.75 object-image size ratios. Oxford-102 [21] contains 8,189 images of flowers from 102 different categories. To show the generalization capability of our approach, a more challenging dataset, MS COCO [16] is also utilized for evaluation. Different from CUB and Oxford102, the MS COCO dataset contains images with multiple objects and various backgrounds. It has a training set with 80k images and a validation set with 40k images. Each image in COCO has 5 descriptions, while 10 descriptions are provided by [25] for every image in CUB and Oxford102 datasets. Following the experimental setup in [26], we directly use the training and validation sets provided by COCO, meanwhile we split CUB and Oxford-102 into class-disjoint training and test sets.\n\nEvaluation metrics. It is difficult to evaluate the performance of generative models ( e.g ., GAN). We choose a recently proposed numerical assessment approach 'inception score' [29] for quantitative evaluation,\n\n<!-- formula-not-decoded -->\n\nwhere x denotes one generated sample, and y is the label predicted by the Inception model [30]. The intuition behind this metric is that good models should generate diverse but meaningful images. Therefore, the KL divergence between the marginal distribution p y ( ) and the conditional distribution p y ( | x ) should be large. In our experiments, we directly use the pre-trained Inception model for COCO dataset. For fine-grained datasets, CUB and Oxford-102, we fine-tune an Inception model for each of them. As suggested in [29], we evaluate this metric on a large number of samples ( i.e ., 30k randomly selected samples) for each model.\n\nAlthough the inception score has shown to well correlate with human perception on visual quality of samples [29], it cannot reflect whether the generated images are well conditioned on the given text descriptions. Therefore, we also conduct human evaluation. We randomly select 50 text descriptions for each class of CUB and Oxford-102 test sets. For COCO dataset, 4k text descriptions are randomly selected from its validation set. For each sentence, 5 images are generated by each model. Given the same text descriptions, 10 users (not including any of the authors) are asked to rank the results by different methods. The average ranks by human users are calculated to evaluate all compared methods.",
        "metadata": {
            "section_header": "Datasets and evaluation metrics",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.2. Quantitative and qualitative results\n\nWe compare our results with the state-of-the-art text-toimage methods [24, 26] on CUB, Oxford-102 and COCO\n\nText description\n\n64x64 GAN-INT-CLS\n\n128x128 GAWWN\n\nThis bird is red and brown in color, with a stubby beak\n\n<!-- image -->\n\n<!-- image -->\n\nThe bird is short and stubby with yellow on its body\n\n<!-- image -->\n\n<!-- image -->\n\nA small yellow bird with a black crown and a short black pointed beak\n\n<!-- image -->\n\n<!-- image -->\n\nThis small black bird has a short, slightly curved bill and long legs\n\n<!-- image -->\n\n<!-- image -->\n\nThis small bird has a white breast, light grey head, and black wings and tail\n\n<!-- image -->\n\n<!-- image -->\n\nA small bird with varying shades of brown with white under the eyes\n\n<!-- image -->\n\n<!-- image -->\n\nA bird with a medium orange bill white body gray wings and webbed feet\n\n<!-- image -->\n\n<!-- image -->\n\n256x256 StackGAN\n\nFigure 3. Example results by our StackGAN, GAWWN [24], and GAN-INT-CLS [26] conditioned on text descriptions from CUB test set.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nText description\n\nThis flower has a lot of small purple petals in a dome-like configuration\n\nThis flower is pink, white, and yellow in color, and has petals that are striped\n\nThis flower is white and yellow in color, with petals that are wavy and smooth\n\nThis flower has petals that are dark pink with white edges and pink stamen\n\nEggs fruit candy nuts and meat served on white dish\n\nA street sign on a stoplight pole in the middle of a day\n\nA group of people on skis stand in the snow\n\nA picture of a very clean living room\n\n64x64 GAN-INT-CLS\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n256x256 StackGAN\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nFigure 4. Example results by our StackGAN and GAN-INT-CLS [26] conditioned on text descriptions from Oxford-102 test set (leftmost four columns) and COCO validation set (rightmost four columns).\n\n| Metric          | Dataset   | GAN-INT-CLS   | GAWWN      | Our StackGAN   |\n|-----------------|-----------|---------------|------------|----------------|\n| Inception score | CUB       | 2.88 ± .04    | 3.62 ± .07 | 3.70 ± .04     |\n| Inception score | Oxford    | 2.66 ± .03    | /          | 3.20 ± .01     |\n| Inception score | COCO      | 7.88 ± .07    | /          | 8.45 ± .03     |\n| Human rank      | CUB       | 2.81 ± .03    | 1.99 ± .04 | 1.37 ± .02     |\n| Human rank      | Oxford    | 1.87 ± .03    | /          | 1.13 ± .03     |\n| Human rank      | COCO      | 1.89 ± .04    | /          | 1.11 ± .03     |\n\nTable 1. Inception scores and average human ranks of our StackGAN, GAWWN [24], and GAN-INT-CLS [26] on CUB, Oxford102, and MS-COCO datasets.\n\nerage human rank on all three datasets. Compared with GAN-INT-CLS [26], StackGAN achieves 28.47% improvement in terms of inception score on CUB dataset (from 2.88 to 3.70), and 20.30% improvement on Oxford-102 (from 2.66 to 3.20). The better average human rank of our StackGANalso indicates our proposed method is able to generate more realistic samples conditioned on text descriptions.\n\ndatasets. The inception scores and average human ranks for our proposed StackGAN and compared methods are reported in Table 1. Representative examples are compared in Figure 3 and Figure 4.\n\nOur StackGAN achieves the best inception score and av-\n\nAs shown in Figure 3, the 64 × 64 samples generated by GAN-INT-CLS [26] can only reflect the general shape and color of the birds. Their results lack vivid parts ( e.g ., beak and legs) and convincing details in most cases, which make them neither realistic enough nor have sufficiently high resolution. By using additional conditioning variables on loca-\n\nText description  and has a very This bird is blue with white short beak\n\nStage-I images\n\nStage-II images\n\nThis bird has wings that are brown and has a yellow belly\n\nThis bird is white, black, and brown in color, with a brown beak\n\nA white bird with a black crown and yellow beak\n\nThis is a small, black bird with a white breast and white on the wingbars.\n\nThe bird has small beak, with reddish brown crown and gray belly\n\n<!-- image -->\n\nThis bird is white black and yellow in color, with a short black beak\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nFigure 5. Samples generated by our StackGAN from unseen texts in CUB test set. Each column lists the text description, images generated from the text by Stage-I and Stage-II of StackGAN.\n\n<!-- image -->\n\nFive nearest neighbors from training sets\n\nFigure 6. For generated images (column 1), retrieving their nearest training images (columns 2-6) by utilizing Stage-II discriminator D to extract visual features. The L 2 distances between features are calculated for nearest-neighbor retrieval.\n\n<!-- image -->\n\ntion constraints, GAWWN [24] obtains a better inception score on CUB dataset, which is still slightly lower than ours. It generates higher resolution images with more details than GAN-INT-CLS, as shown in Figure 3. However, as mentioned by its authors, GAWWN fails to generate any plausible images when it is only conditioned on text descriptions [24]. In comparison, our StackGAN can generate 256 × 256 photo-realistic images from only text descriptions.\n\ning the short beak and white color described in the text as well as details for the tail and legs. In all other examples, different degrees of details are added to Stage-II images. In many other cases, Stage-II GAN is able to correct the defects of Stage-I results by processing the text description again. For example, while the Stage-I image in the 5 th column has a blue crown rather than the reddish brown crown described in the text, the defect is corrected by Stage-II GAN. In some extreme cases ( e.g ., the 7 th column of Figure 5), even when Stage-I GAN fails to draw a plausible shape, Stage-II GAN is able to generate reasonable objects. We also observe that StackGAN has the ability to transfer background from Stage-I images and fine-tune them to be more realistic with higher resolution at Stage-II.\n\nFigure 5 illustrates some examples of the Stage-I and Stage-II images generated by our StackGAN. As shown in the first row of Figure 5, in most cases, Stage-I GAN is able to draw rough shapes and colors of objects given text descriptions. However, Stage-I images are usually blurry with various defects and missing details, especially for foreground objects. As shown in the second row, StageII GAN generates 4 × higher resolution images with more convincing details to better reflect corresponding text descriptions. For cases where Stage-I GAN has generated plausible shapes and colors, Stage-II GAN completes the details. For instance, in the 1 st column of Figure 5, with a satisfactory Stage-I result, Stage-II GAN focuses on draw-\n\nImportantly, the StackGAN does not achieve good results by simply memorizing training samples but by capturing the complex underlying language-image relations. We extract visual features from our generated images and all training images by the Stage-II discriminator D of our StackGAN. For each generated image, its nearest neighbors from the training set can be retrieved. By visually inspecting the retrieved images (see Figure 6), we can conclude that the generated images have some similar characteristics with the training samples but are essentially different.",
        "metadata": {
            "section_header": "Quantitative and qualitative results",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 4.3. Component analysis\n\nIn this subsection, we analyze different components of StackGAN on CUB dataset with our baseline models. The inception scores for those baselines are reported in Table 2.\n\nThe design of StackGAN. As shown in the first four rows of Table 2, if Stage-I GAN is directly used to generate images, the inception scores decrease significantly. Such performance drop can be well illustrated by results in Figure 7. As shown in the first row of Figure 7, Stage-I GAN fails to generate any plausible 256 × 256 samples without\n\nA small bird with a black head and wings and features grey wings\n\n256x256 Stage-I GAN without CA\n\n256x256 Stage-I GAN with CA\n\n256x256 StackGAN with CA, Text twice\n\n<!-- image -->\n\nThis bird is completely red with black wings and pointy beak\n\n<!-- image -->\n\nFigure 7. Conditioning Augmentation (CA) helps stabilize the training of conditional GAN and improves the diversity of the generated samples. (Row 1) without CA, Stage-I GAN fails to generate plausible 256 × 256 samples. Although different noise vector z is used for each column, the generated samples collapse to be the same for each input text description. (Row 2-3) with CA but fixing the noise vectors z , methods are still able to generate birds with different poses and viewpoints.\n\nTable 2. Inception scores calculated with 30,000 samples generated by different baseline models of our StackGAN.\n\n| Method                | CA         | Text twice   | Inception score                  |\n|-----------------------|------------|--------------|----------------------------------|\n| 64 × 64 Stage-I GAN   | no yes     | / /          | 2.66 ± .03 2.95 ± .02            |\n| 256 × 256 Stage-I GAN | no yes     | / /          | 2.48 ± .00 3.02 ± .01            |\n| 128 × 128 StackGAN    | yes no yes | no yes yes   | 3.13 ± .03 3.20 ± .03 3.35 ± .02 |\n| 256 × 256 StackGAN    | yes no yes | no yes yes   | 3.45 ± .02 3.31 ± .03 3.70 ± .04 |\n\nusing Conditioning Augmentation (CA). Although Stage-I GAN with CA is able to generate more diverse 256 × 256 samples, those samples are not as realistic as samples generated by StackGAN. It demonstrates the necessity of the proposed stacked structure. In addition, by decreasing the output resolution from 256 × 256 to 128 × 128, the inception score decreases from 3.70 to 3.35. Note that all images are scaled to 299 × 299 before calculating the inception score. Thus, if our StackGAN just increases the image size without adding more information, the inception score would remain the same for samples of different resolutions. Therefore, the decrease in inception score by 128 × 128 StackGAN demonstrates that our 256 × 256 StackGAN does add more details into the larger images. For the 256 × 256 StackGAN, if the text is only input to Stage-I (denoted as 'no Text twice'), the inception score decreases from 3.70 to 3.45. It indicates that processing text descriptions again at Stage-II helps refine Stage-I results. The same conclusion can be drawn from the results of 128 × 128 StackGAN models.\n\nConditioning Augmentation. We also investigate the efficacy of the proposed Conditioning Augmentation (CA). By removing it from StackGAN 256 × 256 (denoted as 'no CA' in Table 2), the inception score decreases from 3.70 to 3.31. Figure 7 also shows that 256 × 256 Stage-I GAN (and StackGAN) with CA can generate birds with different poses\n\nFigure 8. (Left to right) Images generated by interpolating two sentence embeddings. Gradual appearance changes from the first sentence's meaning to that of the second sentence can be observed. The noise vector z is fixed to be zeros for each row.\n\n<!-- image -->\n\nand viewpoints from the same text embedding. In contrast, without using CA, samples generated by 256 × 256 StageI GAN collapse to nonsensical images due to the unstable training dynamics of GANs. Consequently, the proposed Conditioning Augmentation helps stabilize the conditional GAN training and improves the diversity of the generated samples because of its ability to encourage robustness to small perturbations along the latent manifold.\n\nSentence embedding interpolation. To further demonstrate that our StackGAN learns a smooth latent data manifold, we use it to generate images from linearly interpolated sentence embeddings, as shown in Figure 8. We fix the noise vector z , so the generated image is inferred from the given text description only. Images in the first row are generated by simple sentences made up by us. Those sentences contain only simple color descriptions. The results show that the generated images from interpolated embeddings can accurately reflect color changes and generate plausible bird shapes. The second row illustrates samples generated from more complex sentences, which contain more details on bird appearances. The generated images change their primary color from red to blue, and change the wing color from black to brown.",
        "metadata": {
            "section_header": "Component analysis",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## 5. Conclusions\n\nIn this paper, we propose Stacked Generative Adversarial Networks (StackGAN) with Conditioning Augmentation for synthesizing photo-realistic images. The proposed method decomposes the text-to-image synthesis to a novel sketch-refinement process. Stage-I GAN sketches the object following basic color and shape constraints from given text descriptions. Stage-II GAN corrects the defects in Stage-I results and adds more details, yielding higher resolution images with better image quality. Extensive quantitative and qualitative results demonstrate the effectiveness of our proposed method. Compared to existing text-to-image generative models, our method generates higher resolution images ( e.g ., 256 × 256) with more photo-realistic details and diversity.",
        "metadata": {
            "section_header": "Conclusions",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## Supplementary Materials",
        "metadata": {
            "section_header": "Supplementary Materials",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## More Results of Birds and Flowers",
        "metadata": {
            "section_header": "More Results of Birds and Flowers",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## Additional Results on CUB Dataset\n\nThis bird sits close to the ground with his short yellow tarsus and feet; his bill is long and is also yellow and his color is mostly white with a black crown and primary feathers\n\nStage-I images\n\nStage-II images\n\nA large bird has large thighs and large wings that have white wingbars\n\n<!-- image -->\n\nStage-I images\n\nStage-II images\n\nThis smaller brown bird has white stripes on the coverts, wingbars and secondaries\n\n<!-- image -->\n\nStage-I images\n\nStage-II images\n\nA cardinal looking bird, but fatter with gray wings, an orange head, and black eyerings\n\n<!-- image -->\n\nStage-I images\n\nStage-II images\n\n<!-- image -->\n\nThe small bird has a red head with feathers that fade from red to gray from head to tail\n\nStage-I images\n\nStage-II images\n\nThis bird is black with green and has a very short beak\n\n<!-- image -->\n\nStage-I images\n\nStage-II images\n\nThis bird is light brown, gray, and yellow in color, with a light colored beak\n\n<!-- image -->\n\nStage-I images\n\nStage-II images\n\nThis bird has wings that are black and has a white belly\n\n<!-- image -->\n\nStage-I images\n\nStage-II images\n\n<!-- image -->",
        "metadata": {
            "section_header": "Additional Results on CUB Dataset",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## Additional Results on Oxford-102 Dataset\n\nThis flower is yellow in color, with petals that are vertically layered\n\nStage-I images\n\nStage-II images\n\nStage-I images\n\n<!-- image -->\n\nStage-II images\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nThis flower has white petals with a yellow tip and a yellow pistil\n\nA flower with small pink petals and a massive central orange and black stamen cluster\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nStage-I images\n\nThis flower is white, pink, and yellow in color, and has petals that are multi colored\n\n<!-- image -->\n\nStage-II images\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nStage-I images\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nStage-II images\n\n<!-- image -->\n\nStage-I images\n\nStage-II images\n\n<!-- image -->\n\nThis flower has petals that are yellow with shades of orange\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->",
        "metadata": {
            "section_header": "Additional Results on Oxford-102 Dataset",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## Failure Cases\n\nThe main reason for failure cases is that Stage-I GAN fails to generate plausible rough shapes or colors of the objects.",
        "metadata": {
            "section_header": "Failure Cases",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## CUB failure cases:\n\nText description  brown body This particular bird has a and brown bill\n\nStage-I images\n\nStage-II images\n\n<!-- image -->\n\n<!-- image -->",
        "metadata": {
            "section_header": "CUB failure cases:",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## Oxford-102 failure cases:\n\nText description  white with a The petals of this flower are large stigma\n\nA unique yellow flower with no visible pistils protruding from the center\n\nStage-I images\n\nStage-II images\n\n<!-- image -->\n\n<!-- image -->\n\nGrey bird with black flat beak with grey and white big wings\n\nBird has brown body feathers, brown breast feathers, and brown beak\n\n<!-- image -->\n\nThis flower is pink and yellow in color, with petals that are oddly shaped\n\n<!-- image -->\n\nThe medium sized bird has a dark grey color, a black downward curved beak, and long wings\n\n<!-- image -->\n\nThis is a light colored flower with many different petals on a green stem\n\n<!-- image -->\n\nThis flower is yellow and green in color, with petals that are ruffled\n\n<!-- image -->\n\nColored bill with a white ring around it on the upper part near the bill\n\nThis bird has a dark brown overall body color, with a small white patch around the base of the bill\n\n<!-- image -->\n\nThe flower have large petals that are pink with yellow on some of the petals\n\n<!-- image -->\n\nThis medium sized bird is primarily black and has a large wingspan and a long black bill with a strip of white at the beginning of it\n\n<!-- image -->\n\nA flower that has white petals with some tones of yellow and green filaments\n\n<!-- image -->",
        "metadata": {
            "section_header": "Oxford-102 failure cases:",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## Beyond Birds and Flowers: Results on MS COCO\n\nResults on COCO dataset demonstrate the generalization capability of our approach on images with multiple objects and complex backgrounds.",
        "metadata": {
            "section_header": "Beyond Birds and Flowers: Results on MS COCO",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    },
    {
        "page_content": "## Diverse samples can be generated for each text description.\n\nA living room with hard wood floors filled with furniture\n\nStage-I images\n\nStage-II images\n\nThere are many pieces of broccoli and vegetables here\n\n<!-- image -->\n\nStage-I images\n\nStage-II images\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nMore results. We observe that StackGAN is able to synthesize reasonable images in various cases, although the image quality is lower than the results of birds and flowers. In the future work, we aim to further investigate more sophisticated stacked architectures for generating more complex scenes.\n\nText description\n\nThe white kitchen features very contemporary cabinet arrangements\n\nTwo public transit buses parted in a lot\n\nA big airplane flying in the big blue sky\n\nA couple of men riding horses on top of a green field\n\nA train coming to a stop on the tracks out side\n\nA group of boats on a body of water\n\nThe man is standing in the water holding his surfboard\n\nStage-II images\n\nText description\n\nStage-II images\n\n<!-- image -->\n\n<!-- image -->\n\nA big building with a parking lot in front of it\n\n<!-- image -->\n\nThere is a lot of electrical sitting on the table\n\n<!-- image -->\n\n<!-- image -->\n\nA couple of computer screens sitting on a desk\n\n<!-- image -->\n\n<!-- image -->\n\nThree zeebras standing in a grassy field walking\n\n<!-- image -->\n\n<!-- image -->\n\nA herd of cows standing on a grass covered field\n\n<!-- image -->\n\n<!-- image -->\n\nA group of people standing around and posing for a picture\n\n<!-- image -->\n\n<!-- image -->\n\nPeople who are dressed for skiing standing in the snow\n\n<!-- image -->",
        "metadata": {
            "section_header": "Diverse samples can be generated for each text description.",
            "title": "StackGAN: Text to Photo-realistic Image Synthesis with Stacked Generative Adversarial Networks",
            "type": "paper"
        }
    }
]