{
  "irVersion": "3",
  "producerName": "onnx-caffe2",
  "producerVersion": "",
  "domain": "",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "gpu_0/conv1_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/conv1_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/pred_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/pred_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/pred_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/pred_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch1_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch1_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch1_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch1_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch1_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch1_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch1_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch1_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch1_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch1_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch2a_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch2a_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch2b_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch2b_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch2c_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch2c_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch2c_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch2c_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch2c_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch2c_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch2c_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch2c_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_0_branch2c_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_0_branch2c_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_1_branch2a_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_1_branch2a_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_1_branch2b_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_1_branch2b_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_1_branch2c_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_1_branch2c_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_1_branch2c_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_1_branch2c_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_1_branch2c_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_1_branch2c_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_1_branch2c_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_1_branch2c_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_1_branch2c_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_1_branch2c_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_2_branch2a_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_2_branch2a_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_2_branch2b_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_2_branch2b_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_2_branch2c_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_2_branch2c_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_2_branch2c_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_2_branch2c_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_2_branch2c_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_2_branch2c_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_2_branch2c_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_2_branch2c_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res2_2_branch2c_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res2_2_branch2c_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch1_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch1_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch1_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch1_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch1_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch1_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch1_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch1_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch1_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch1_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2a_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2a_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2a_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2a_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2a_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2a_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2a_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2a_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2a_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2a_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2b_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2b_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2b_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2b_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2b_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2b_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2b_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2b_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2b_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2b_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2c_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2c_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2c_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2c_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2c_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2c_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2c_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2c_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_0_branch2c_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_0_branch2c_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2a_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2a_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2a_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2a_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2a_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2a_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2a_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2a_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2a_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2a_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2b_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2b_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2b_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2b_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2b_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2b_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2b_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2b_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2b_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2b_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2c_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2c_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2c_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2c_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2c_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2c_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2c_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2c_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_1_branch2c_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_1_branch2c_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2a_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2a_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2a_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2a_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2a_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2a_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2a_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2a_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2a_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2a_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2b_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2b_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2b_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2b_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2b_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2b_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2b_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2b_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2b_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2b_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2c_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2c_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2c_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2c_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2c_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2c_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2c_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2c_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_2_branch2c_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_2_branch2c_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2a_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2a_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2a_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2a_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2a_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2a_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2a_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2a_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2a_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2a_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2b_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2b_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2b_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2b_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2b_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2b_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2b_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2b_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2b_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2b_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2c_bn_b_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2c_bn_b_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2c_bn_riv_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2c_bn_riv_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2c_bn_rm_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2c_bn_rm_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2c_bn_s_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2c_bn_s_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                0.02
              ],
              "name": ""
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "gpu_0/res3_3_branch2c_w_0__SHAPE"
        ],
        "output": [
          "gpu_0/res3_3_branch2c_w_0"
        ],
        "opType": "ConstantOfShape",
        "attribute": [
